{"Book I": {"PART I": {"title": "CRIMINAL LAW APPLICATION OF CRIMINAL LAW", "chapters": {"CHAPTER 1": {"title": "PRELIMINARY PROVISIONS", "sections": {"SECTION 1": {"title": "CONTENT", "content": "1. Book I comprising Sections 1 to 101;\n2. Book II comprising Sections 102 to 361;\n3. The decree relating to regulatory provisions of the Penal Code which define offences, comprising Sections 362 to 370;\n4. Sections 371 and 372, which lay down the transitional and final\nprovisions.\n"}, "SECTION 1-1": {"title": "NO EXEMPTION", "content": "All persons shall be subject to the criminal law.\n"}, "SECTION 2": {"title": "GENERAL AND SPECIAL APPLICATION", "content": "1. This Code and every provision of criminal law shall be subject to the rules of international law and to ail treaties duly promulgated and published. \n2. Book I of this Code shall govern ail other criminal law, unless special provision has been made, even before the entry into force of this book, concerning particularly the exclusion of suspension and the exclusion or limitation of mitigating circumstances by a law or by regulations possessing force of law. This Subsection shall apply actively from the 1st October 1966 inclusive.\n3. Any other general provision shall be subject to any special provision on the same matter, save as otherwise provided.\n"}}}, "CHAPTER 2": {"title": "APPLICATION OF CRIMINAL LAW IN TIME", "sections": {"SECTION 3": {"title": "NO RETROSPECTION", "content": "No criminal law shall apply to acts or omissions committed before its coming into force or in respect of which judgment has not been delivered before its repeal or expiry.\n"}, "SECTION 4": {"title": "LESS SEVERE LAW", "content": "1. A new provision of criminal law shall, if less severe, apply to any offence in respect of which judgment has not been delivered before its coming into force\n2. Where the new provision is more severe, the old law shall continue to apply to offences committed before its coming into force.\n"}, "SECTION 5": {"title": "NEW PREVENTIVE MEASURE", "content": "A new law authorizing a preventive measure shall apply to any case where judgment has not become final before its coming into force.\n"}, "SECTION 6": {"title": "ABOLITION OF OFFENCE, PENALTY OR MEASURE", "content": "Any penalty or preventive measure shall cease to be enforceabie: \n1. From the moment when the act or omission in respect of which it was imposed is no longer an offence ;\n2. **On the abolition of the penalty or measure generally.**\n"}}}, "CHAPTER 3": {"title": "APPLICATION IN SPACE", "sections": {"SECTION 7": {"title": "OFFENCE WITHIN TERRITORY", "content": "1.  The criminal law of the Republic shall apply to any act done or omitted within its territory. \n2. The territory of the Republic shall include its territorial waters and the airspace above the said territory and waters, and all vessels and aircrafts\nProvided that no member of the crew of a foreign vessel or aircraft may be tried for an offence committed against another member of the same crew on board that vessel or aircraft, though within the territorial waters or airspace of the Republic, unless the assistance of the local authorities shall have been invoked or public order shall have been disturbed.\n"}, "SECTION 8": {"title": "**OFFENCE PARTLY OR WHOLLY ABROAD**", "content": "The criminal law of the Republic shall apply:\n1. To any offence of which any ingredient has taken place within its territory ; \n2. To any offence against the security of the State or of counterfeiting the Great Seal or the current money of the State wherever committed.\nProvided that no foreigner may be tried for an offence to which the law of the Republic applies solely by virtue of this Subsection unless he has been arrested within the territory of the Republic or has been extradited to it.\n"}, "SECTION 9": {"title": "ABETMENT, CONSPIRACY, ATTEMPT", "content": "The criminal law of the Republic shall apply:\n1. to any act or omission within its territory constituting abetment, conspiracy or attempt with a view to an offence without that territory, provided that the said offence be also punishable by the law of the place of commission ; \n2. to any such act or omission without its territory with a view to an offence within that territory.\n"}, "SECTION 10": {"title": "OFFENCE ABROAD BY CITIZEN OR RESIDENT", "content": "1. The criminal law of the Republic shall apply to any actor omission abroad by a citizen or resident, which is punishable by the law of the place of commission and is defined as a felony or as a misdemeanour by the law of the Republic.\nProvided that the sentence passed may not be more severe than that provided by the foreign law.\n2. No citizen or resident may be tried for a misdemeanor against a private party to which the law of the Republic applies solely by virtue of this Section except at the instance of the authority controlling prosecution after private complaint or after official request to the Government of the Republic by the Government of the place of commission\n"}, "SECTION 11": {"title": "INTERNATIONAL OFFENCES", "content": "The criminal law of the Republic shall apply to mercenary, racial discrimination, piracy, trafficking in persons, slave trade, slavery, trafficking in narcotics, trafficking in toxic wastes. money laundering, cyber criminality. corruption and offences of misappropriation of public property committed even outside the territory of the Republic.\nProvided that, no foreigner may be tried in the Republic for such an offence committed abroad unless he has been arrested in the Republic and has not been extradited, and except at the instance of the authority controlling prosecution.\n"}, "SECTION 12": {"title": "GENERAL JURISDICTION", "content": "Subject to the exceptions contained in this chapter, the Courts of the Republic shall have jurisdiction to try any offence to which its criminal law is applicable.\n"}}}, "CHAPTER IV": {"title": "FOREIGN CRIMINAL LAW AND JUDGMENTS", "sections": {"SECTION 13": {"title": "EXCLUSION OF FOREIGN LAW", "content": "Subject to Sections 9 and 10 of this Code and to this chapter, no foreign criminal law shall have any effect in the courts of the Republic.\n"}, "SECTION 14": {"title": "FOREIGN JUDGMENTS", "content": "No foreign criminal judgment against any person shall have effect within the territory of the Republic unless:\n- the act or omission in question is defined by the law of the Republic as a felony or misdemeanour under the ordinary law ;\n- the regularity of the judgment, its finality, and its conformity with the public policy of the Republic shall have been ascertained either by the Court trying the person in question or by the Court of Appeal of his residence at the instance of the authority controlling prosecution.\n"}, "SECTION 15": {"title": "EFFECT OF FOREIGN CRIMINAL JUDGMENT", "content": "Such judgment shall:\n- be taken into consideration as a previous conviction for the purposes of aggravation of sentence, of preventive confinement, of suspension of sentence or revocation of such suspension, of revocation of release on licence, of rehabilitation, and of amnesty ;\n- found a good plea in the courts of the Republic convict or acquit, provided that in the case of conviction the accused shall have served his sentence or satisfied it by prescription or pardon.\n"}, "SECTION 16": {"title": "EXECUTION OF FOREIGN JUDGMENT", "content": "1. Any such judgment as is contemplated by Section 14 and has been ascertained to conform to that Section, if passed against a citizen or against a resident, and not enforced elsewhere, shall be capable of enforcement within the territory of the Republic, unless enforcement shall have been barred by release on licence, pardon, amnesty or prescription. \n2. Enforcement shall require the order of the court contemplated by Section 14, which may also, in a fit case, impose the preventive measures attracted according to the law of the Republic by the offence in question.\n"}}}}}, "PART II": {"title": "PUNISHMENT AND PREVENTION", "chapters": {"CHAPTER 1": {"title": "PRELIMINARY PROVISIONS", "sections": {"SECTION 17": {"title": "PENALTIES AND OFFENCES TO BE PRESCRIBED", "content": "No penalty or measure may be imposed unless provided by law, and except in respect of an offence lawfully defined.\n"}, "SECTION 18": {"title": "PRINCIPAL PENALTIES", "content": "The following are principal penalties:\n1. For natural persons: \n- Death penalty ;\n- Imprisonment ;\n- Fine.\n1. For corporate bodies\n- Dissolution,\n- Temporary or final closure;\n- Fine\n"}, "SECTION 18-1": {"title": "ALTERNATIVE PENALTIES", "content": "The following are alternative penalties:\n- Community service ;\n- Reparatory sentence.\n"}, "SECTION 19": {"title": "ACCESSORY PENALTIES", "content": "The following are accessory penalties:\n1. For natural persons:\n- Forfeiture ;\n- Publication of the judgment ;\n- Closure of an establishment ;\n- Confiscation.\n1. For corporate bodies\n- Ban, for a specified period of time, on the direct or indirect exercise of any or ail of its activities :\n- Placement under judicial supervision for a specified period of time ;\n- Closure, for a specified period of time, of establishments or branches having served in the commission of offences ;\n- Publication or media broadcast of the judgment ;\n- Any other accessory penalties provided for by special instruments.\n"}, "SECTION 20": {"title": "PREVENTIVE MEASURES", "content": "The following are preventive measures:\n1. For natural persons:\n- Ban on exercise of activity ;\n- Preventive confinement\n- Post-penal supervision and assistance;\n- Confinement in a special health institution\n- Confiscation\n1. For corporate bodies\n- Ban on exercise of activity for a specified period of time ;\n- Confiscation ;\n- Placement under judicial supervision, for a specified period of time\n"}, "SECTION 21": {"title": "CLASSIFICATION OF OFFENCES", "content": "1. Offences shall be classified as felonies, misdemeanours and simple offences according to the principal penalties provided for them, as follows: \n   - A felony shall mean an offence punishable with death or with loss of liberty for a maximum of more than 10 (ten) years and fine where the law so provides ;\n   - A misdemeanor shall mean an offence punishable with loss of liberty or with fine, where the loss of liberty may be for more than 10 (ten) days but not for more than 10 (ten) years, and the fine more than CFAF 25 000 (twenty-five thousand);\n   - A simple offence shall mean an offence punishable with imprisonment for up to 10 (ten) days or with fine of up to CFAF25 000 (twenty-five thousand).\n2. The nature of the offence shall not be affected by: \n   - modification of the penalty imposed by reason of an excuse or of mitigating circumstances;\n   - aggravation of the penalty imposed under Sections 88 or 89 of this Code.\n"}}}, "CHAPTER 2": {"title": "PRINCIPAL PENALTIES", "sections": {"SECTION 22": {"title": "CONDITIONS PRECEDENT TO EXECUTION", "content": "1. Every sentence of death shall be submitted to the President of the Republic for his decision on commutation. \n2. No death sentence may be executed until the President shall have signified his decision not to commute. \n3. No woman with child may be executed until after her delivery. \n4. No execution may take place on Sunday or on a public holiday\n"}, "SECTION 23": {"title": "EXECUTION", "content": "1. Execution of a death sentence shall be by shooting or hanging as may be ordered by the judgment and shall be public unless otherwise ordered in the decision not to commute.\n2. The bodies of persons executed shall be returned to their families at their request, but on condition of a quiet funeral \n3. Nothing may be published by the press beyond the official record of the execution and any official communique that may be released. \n4. The detailed application of this Section shall be prescribed by decree.\n"}, "SECTION 24": {"title": "IMPRISONMENT", "content": "Imprisonment shall mean loss of liberty during which the offender shall be obliged to work, subject to any contrary order of the court for reasons to be recorded in the judgment.\n"}, "SECTION 25": {"title": "PRISONER’S FUND", "content": "1. The proceeds of every prisoner’s work shall be allocated as follows:\n   - 1/3 to the Treasury;\n   - 2/3 to the building up or a reserve fund for the prisoner.\n2. The conditions governing the implementation of this Section, particularly those with regard to the management of the fund shah be laid down by regulation.\n"}, "SECTION 25-1": {"title": "FINE", "content": "1. Fine shall mean a financial penalty by virtue of which a convict, natural person or corporate body, pays an amount of money, specified by Law, into the Public Treasury.\n2. The maximum amount of fine applicable to corporate bodies shall be five times that provided for natural persons.\n3. Where a corporate body is guilty of an offence punishable with imprisonment only, the fine to be paid shall be from CFAF 1 000 000 (one million) to CFAF 500 000 000 (five hundred million).\n"}, "SECTION 25-2": {"title": "DISSOLUTION", "content": "1. Dissolution shall mean capital punishment which may be passed against corporate bodies.\n2. A judgment on dissolution may be passed against a corporate body that has acted in violation of its object clause.\n3. The judgment on the dissolution of a corporate body shall refer such corporate body to the competent court for winding up at the instance of the Legal Department.\n"}, "SECTION 25-3": {"title": "CLOSURE OF AN ESTABLISHMENT", "content": "The penalty of closure of an establishment shall mean the temporary or final closure of an establishment considered to be a corporate body.\nSuch penalty shall prohibit the accused corporate body from carrying out the activity through which the offence was committed.\nSuch temporary closure may not exceed 5 (five) years and may not be suspended.\n"}, "SECTION 26": {"title": "COMMUNITY SERVICE", "content": "1. Community service shall be a sentence passed for offences punishable with imprisonment of less than two years or with fine only. Such sentence shall be executed for the benefit of a public corporation, a private corporation charged with a public service mission or an association entrusted with performing a community service.\n2. The sentence provided under Sub-section (1) above shall be passed by the trial court in lieu of imprisonment or fine, after ruling on the plea of guilty with the prier consent of the accused person.\n3. The court shall fix the period of community service which shall not be less than two hundred hours or more than 240 (two hundred and forty) hours and shall not be suspended.\n4. Community service shall be free of charge.\n5. The judgment shall State the period of imprisonment that may be served by the offender in case of non-performance of community service; such a period of imprisonment shall not be suspended.\n6. Community service shall be laid down by a separate instrument.\n"}, "SECTION 26-1": {"title": "REPARATORY SENTENCE", "content": "1. Reparatory sentence shall mean a sentence passed for offences punishable with imprisonment for not more than 2 (two) years or with fine only.\nIt entails the obligation, for the offender, to indemnify the viçtim within the period and under the conditions laid down by the court.\n1. The sentence provided under Sub-section 1 above shall be pronounced by the trial court in lieu of imprisonment or fine after ruling on the plea of guilty and such sentence may not be suspended.\n2. The judgment shall State the period of imprisonment that may be served by the offender n case of non-performance of the reparatory\nsentence\n"}, "SECTION 26-2": {"title": "APPLICATION OF ALTERNATIVE PENALTIES", "content": "The conditions governing the application of alternative penalties shall be laid down by a separate instrument.\n"}, "SECTION 26-3": {"title": "PERSONS EXCLUDED FROM ALTERNATIVE PENALTIES", "content": "The alternative penalties provided for in Sections 26 and 26-1 above shall not apply to persons who violate the law on arms, those who commit sexual offences and those who cause bodily injury as specified in this Code.\n"}, "SECTION 27": {"title": "COMMENCEMENT OF SENTENCE", "content": "1. Where the offender has not been remanded in custody or where no arrest or imprisonment warrant is issued against him at the time of judgment in the circumstances authorized by the Criminal Procedure Code, no sentence of loss of liberty may be enforced until it has become final.\n2. No woman who is with child or who has been recently delivered may begin to serve her sentence until six weeks after delivery.\n3. A woman with child already remanded in custody shall continue to benefit from the regime of remand in custody until the expiry of the period referred to in Subsection 2 above.\n4. Where a husband and wife have been sentenced for the same or different offences to imprisonment for less than a year, and are not in custody at the time of sentence, and show that they hâve a fixed common residence and a child under the âge of 18 (eighteen) supported by them and in their charge, the sentence on one may be suspended until expiry of the sentence on the other.\n"}, "SECTION 28": {"title": "CALCULATION OF SENTENCE", "content": "1. In a sentence of loss of liberty expressed in days, each day shall mean 24 (twenty-four) hours.\n2. Sentence of one month shall mean 30 (thirty days)\n3. Sentence expressed in months or years shall ne reckoned by calendar date\n4. Subject to Section 53 the duration of the sentence shall include and run from:\n- the day on which the offender was taken into custody under that sentence ;\n- in a case of concurrent sentences passed on different dates, the day on which he was first taken into custody under any such sentence.\n1. In case of escape, the period of unlawful liberty shall not be counted in the duration of the sentence.\n"}, "SECTION 29": {"title": "SEPARATION OF MINORS", "content": "An offender under the age of 18 (eighteen) shall serve his sentence in a special establishment, or, failing such establishment, shall be separated from offenders over that age.\n"}}}, "CHAPTER 3": {"title": "ACCESSORY PENALTIES", "sections": {"SECTION 30": {"title": "DEFINITION", "content": "The forfeitures applicable under this Code shall be the following:\n1. Removal and exclusion from any public service, employment or office \n2. Incapacity to be a juror, assessor, expert referee or sworn expert ; \n3. Incapacity to be guardian, curator, deputy guardian or committee, save of the offender's own children, or member of a family council : \n4. Prohibition on wearing any decoration ; \n5. Prohibition on serving in the armed forces ; \n6. Prohibition on keeping a school, on teaching in any educational establishment, and in general on holding any post connected with the education or care of children.\n"}, "SECTION 31": {"title": "WHERE APPLICABLE", "content": "1. A life sentence shall carry with it for life the forfeitures prescribed oy the last preceding Section\n2. Any other sentence for felony shall carry with it the same forfeitures for the duration of the sentence and for the 10 (ten) years following its expiry or release on licence unrevoked.\n3. The trial court may in any case covered by the last preceding subsection, for reasons to be recorded in the judgment, relieve from one or more of the said forfeitures, or reduce their duration to not less than 2 (two) years.\n4. To a sentence for misdemeanour, and where so authorized by law the competent court may, for reasons to be recorded in the judgment, add, for not more than 5 (five) years, one or more of the forfeitures prescribed by the last preceding Section.\n"}, "SECTION 32": {"title": "FORFEITURES AND JUDGMENT IN DEFAULT", "content": "Where judgment is passed in default, any forfeiture shall take effect as from the date of publication of the notices prescribed by the Criminal Procedure Code.\n"}, "SECTION 33": {"title": "PUBLICATION OF JUDGMENT", "content": "1. Where the competent court may order publication of its judgment, it shall be posted in manner to be prescribed by decree for up to 2 (two) months in the case of felony or misdemeanour or (15) fifteen days for a simple offence.\n2. In such case, the competent court may order publication of its judgment in such media as it may indicate. \n3. Any such publication shall be at the expense of the convict. \n4. Posting may be limited to the operative part of the judgment. \n5. The provisions under Sub-sections 1, 2, 3 and 4 above shall also apply to corporate bodies.\n6. Information through print media radio and television or by Interne as well as fair comments shall be allowed\n"}, "SECTION 34": {"title": "CLOSURE OF ESTABLISHMENT", "content": "  Where the competent court orders the closure of a business or industrial establishment, or of any premises devoted to gainful activity, which was used for the commission of an offence, such closure shall imply a ban on\nthe exercise of the same business or mdustry or activity in the same premises, whether by the offended or by any other to whom he may sell, transfer or let the establishment or premises,\n"}, "SECTION 34-1": {"title": "PLACEMENT UNDER JUDICIAL SUPERVISION", "content": "1. The sentence of placement under court supervision shall be applicable to corporate bodies found criminally liable and shall consist in the appointment of a judicial representative whose control mission and period thereof shall be prescribed by the Court. \n2. The mission referred to under sub-section 1 above shall concern only the activity in respect of which the offence was committed. \n3. The judicial representative referred to in subsection 1 above shall render account of his mission as regularly as necessary to the competent State Counsel.\n4. At the end of the judicial representative’s mission and based on his report, the competent State Counsel shall seise the Court that ruled on the placement under court supervision, for the corporate body to be relieved of the measure.\n"}, "SECTION 35": {"title": "CONFISCATION OF “CORPUS DELICTI”", "content": "1. On conviction for any felony or misdemeanour, the competent court may order confiscation of any property, moveable or immoveable, belonging to the offender and attached, which was used as an instrument of its commission, or is the proceeds of the offence. \n2. Such confiscation may not be ordered on conviction for a simple offence unless specially authorized by law.\n"}}}, "CHAPTER IV": {"title": "PREVENTIVE MEASURES", "sections": {"SECTION 36": {"title": "BANNED OCCUPATION", "content": "1. Upon conviction for a felony or misdemeanour under the ordinary law, the court may, for reasons to be recorded in the judgment, forbid the convict from continuing to follow any occupation found to stand in a direct relation to the offence, and his continuation in which would give grave reason to apprehend a repetition.\n2. Subject to any contrary provision of law, the ban may not be for less than a year non for more than 5 (five) years, after completion of service of the principal sentence.\n3. For corporate bodies, the ban referred to in Sub-sections (1) and (2) above shall correspond to prohibition, for a specified period. from directly or indirectly undertaking one or several activities contained in its purpose.\n4. In case of subsequent conviction under the conditions provided for in Sub-section (1) above and Section 88 of this Code for felony or misdemeanour, the ban shall be for life.\n"}, "SECTION 37": {"title": "DEFINITION", "content": "1. Preventive confinement shall mean confinement for from 5 (five) to 20 (twenty) years under a programme of work and social reformation, during which the offender shall, in default of a separate establishment, be confined separately from convicts serving a sentence of imprisonment. \n2. The internal working of the establishment, the programme for the inmates, the details of their work, and the manner of their reformation shall be prescribed by decree.\n"}, "SECTION 38": {"title": "OFFENDERS NOT LIABLE", "content": "No sentence of preventive confinement may be passed on a person who would be aged less than 25 (twenty-five) or more than 60 (sixty) years at the expiry of his principal sentence.\n"}, "SECTION 39": {"title": "WHERE APPLICABLE", "content": "1. Sentence of preventive confinement may be passed on any offender subject to Section 88 of this Code by reason of the followmg convictions, including that accompanying the sentence, within the space of 10 (ten) years exclusive of any sentence served and any preventive measure involving personal restraint:\n   - two (2) convictions for felony punished with imprisonment or with death commuted first into imprisonment ; or\n   - one such conviction for felony and two for misdemeanour, each punished with more than 1 (one) year of imprisonment ;\n   - four (4) convictions for misdemeanour, each punished with more than 1 (one) year of imprisonment.\n2. The said space of 10 (ten) years shall be counted back from the date of the latest relevant offence.\n3. To be counted for the purpose of preventive confinement a conviction must have become final and must have been for an offence committed after the preceding conviction to be counted has become final. \n4. Previous convictions the sentences which have been commuted, pardoned or remitted shall be taken into account. \n5. Previous convictions expunged by rehabilitation or by amnesty shall not be taken into account.\n6. Previous convictions for offences committed by persons under the age of 18 (eighteen) shall not be taken into account.\n"}, "SECTION 40": {"title": "DEFINITION AND DURATION", "content": "1. Every offender sentenced to loss of liberty for more than a year may on conviction, where the circumstances warrant and for reasons to be recorded in the judgment, be subjected by the court for up to 5 (five) years to post-penal supervision and assistance, consisting of general obligations_and, in a fit case, of added special obligations.\n2. The offender’s compliance with his obligations shall be superintended by a Magistrale nomimated in that behalf with the assistance of\nsalaned or honorary supervisons.\nProvided that where the conviction is for felony or the offender was sentenced under Section 88 of this Code for misdemeanour, his compliance shall be\nsuperintended by the police\n3. The detailed application of this Section shall be prescribed by decree.\n"}, "SECTION 41": {"title": "GENERAL OBLIGATION", "content": "The obligations to which the offender shall always be subject shall be: \n1. To establish his residence in a given place ; \n2. To appear when called by the authority in charge of supervision and assistance ; \n3. To receive Visits from the supervisor and give him all information and papers useful for the verification of his means of support ; \n4. To inform the supervisor in advance, and explain the reasons to him, of any change of employment or residence \n5. To inform the supervisor in advance of any absence of over 15 (fifteen) days, and inform him of his return ; \n6. To obtain the previous permission of the authority in charge before any departure abroad.\n"}, "SECTION 42": {"title": "SPECIAL OBLIGATIONS", "content": "In addition to the general obligations prescribed by the last preceding Section, the Court may impose upon the offender any one or more of the following special obligations:\n1. To take up residence in one or more specified places ;\n2. Not to be present without special and temporary permission in specified places ;\n3. To remain in employment or follow a course of instruction or vocational training ;\n4. To submit to measures of control or of treatment, including treatment in hospital, and in particular with a view to curing an addiction to alcohol or drugs\n5. To contribute to the family expenses, or to pay regularly any maintenance due from him .\n6. To compensate any damage caused by this offence ;\n7. Not to drive any class of motor vehicle, defined in terms of the classification in force for the purpose of driving licences ;\n8. To avoid specified places, such as bars, race-courses, gaming-houses ;\n9. Not to wager;\n10. Abstain from undue consumption of alcohol ;\n11. To avoid the company of specified offenders, in particular his co- offenders of the accessories to the offence ;\n12. Not to receive or lodge at his residence specified persons.\n"}, "SECTION 43": {"title": "INSANE PERSONS", "content": "1. Upon acquittal for insanity on a charge of felony or misdemeanour punishable with 2 (two) years imprisonment or more and where the liberty of the accused shall have been found by the court to be a public danger, the court shall order his confinement in a special institution.\n2. Such confinement may be terminated only by the same court upon evidence by the competent medical authority that the liberty of the confined person is no longer a public danger.\n"}, "SECTION 44": {"title": "ADDICT OR PARTIALLY INSANE", "content": "1. Where an addict to alcohol or drugs, or a person suffering from mental sickness is convicted of a felony or misdemeanor punishable with 2 (two) years imprisonment or more and related to his addiction or mental condition, and where his liberty shall have been found to be a public danger, the competent court may order his confinement in a special health institution. \n2. Such confinement shall not exceed 2 (two) years in the case of an addict to alcohol or drugs, nor 5 (five) years in the case of the mentally sick. \n3. Such confinement may be earlier terminated by the court upon evidence by the competent medical authority that the liberty of the confined person is no longer a public danger.\n"}, "SECTION 45": {"title": "CONFISCATION", "content": "The confiscation of anything whose manufacture, custody, sale or use is unlawful shall be ordered even if not belonging to the offender and even if not belonging to the offender, and even if the prosecution does not result in conviction.\n"}}}, "CHAPTER V": {"title": "RECOGNIZANCE", "sections": {"SECTION 46": {"title": "WHERE APPLICABLE", "content": "1. Any person who by his conduct or by his utterances shall have exhibited an unambiguous intention to commit an offence which may disturb the public peace may be required by the President of the District Court to enter into a recognizance with or without solvent sureties in such sum as may be therein fixed to refrain from commission of any offence of the like nature for the duration of the period therein specified \n2. The sum shall be fixed having regard to the resources of the person bound over.\n"}, "SECTION 47": {"title": "PERIOD", "content": "Where the person required to enter into the recognizance is a habitual offender, the period of the recognizance may extend to 3 (three) years, but shall not otherwise exceed 1 (one) year.\n"}, "SECTION 48": {"title": "RECOGNIZANCE BY PARENTS", "content": "Where a person under the age of 18 (eighteen) shall hâve committed any act defmed as an offence, the President of the District Court may require his parents, guardian or person responsible under customary law to enter into the recognizance described by Section 46, to be forfeited if the said person shall commit any similar act within the space of 1 (one) year, unless the obligor shall prove that he took ail reasonable steps to avoid the minofs committing the offence.\n"}, "SECTION 49": {"title": "NON-COMPLIANCE", "content": "1. Where a person required to enter into a recognizance does not do so, or fails to find the sureties required, he may be immediately taken into custody until he shall have complied with the order; but such custody may not exceed the period for which the recognizance was required.\n2. Except under Section 48 the obligations described in Section 42 (1)\nand (2) may be substituted for custody.\n"}, "SECTION 50": {"title": "BREACH OF RECOGNIZANCE", "content": "1. Upon conviction of an offence covered by the recognizance the District Court shall without prejudice to any penalty incurred for the offence order forfeiture of the sum therein fixed. \n2. Payment of the said sum shall be enforced as against the person bound over in like manner as if it were a fine, and as against the sureties by any civil process.\n"}}}, "CHAPTER VI": {"title": "CONCURRENT AND CONSECUTIVE SENTENCES", "sections": {"SECTION 51": {"title": "CONCURRENT SENTENCES THE RULE", "content": "1. Where any person is convicted on several charges of felony or misdemeanour tried jointly, or of simple offence tried with either, only one sentence may be passed, not exceeding the maximum prescribed for the most severely punished offence.\n2. Where any person is convicted on several such charges tried separately, any sentence later passed may be ordered to run concurrently with, or in the case of fines to be merged in, any earlier sentence; and where it is not so ordered, the aggregate of the sentences may not exceed the maximum prescribed for the most severely punished offence. \n3.  In the calculation of such aggregate an earlier sentence reduced by remission shall be counted at its reduced and not at its original length. \n4.  No sentence may be ordered to run concurrently with, or to be merged in, a sentence which had already become final before the act or omission in respect of which the second sentence is passed. \n5.  In respect of simple offences sentences shall not be concurrent or merged unless the court shall so order. \n6.  Subject to any contrary order of the court, several sentences other than to principal penalties shall be consecutive as between themselves.\n"}, "SECTION 52": {"title": "CONSECUTIVE SENTENCES", "content": "1. Sentences of loss of liberty shall be enforced in the chronological order in which the imprisonment warrants were notified to the offender. \n2. Accessory penalties and confinement under Section 43 of this Code\nshall run from the date when the sentence becomes final, while other preventive measures shall commence from the expiry or suspension of the principal sentence.\n3. Several consecutive preventive measures shall be enforced in the following order:\n   - Confinement in a health institution ;\n   - Preventive confinement ;\n   - Post-penal supervision and assistance.\n4. Where during the currency of any such measure the offender is sentenced to loss of liberty for another felony or misdemeanour, the preventive measure shall be suspended until the new sentence shall have been served out.\n"}, "SECTION 53": {"title": "REMAND IN CUSTODY", "content": "1. Where the offender has been remanded in custody, the duration of such custody shall be wholly deducted from the computation of loss of liberty. \n2. Where the offender, after having been remanded in custody, is sentenced with fine only, the Court shall relieve him wholly or in part of the said fine.\n"}}}, "CHAPTER VII": {"title": "SUSPENSION AND REMISSION OF SENTENCE", "sections": {"SECTION 54": {"title": "APPLICATION AND EFFECT", "content": "1. Subject to any contrary provision of law, upon conviction for felony or misdemeanour of an offender not previously sentenced to imprisonment, or where after such sentence his conviction has been expunged, the court may, for reasons to be recorded in the judgment, suspend for a period of from 3 (three) to 5 (five) years the enforcement of any sentence of imprisonment for five (5) years or less, or for fine not imposed under Section 92 (2) of this Code.\n2. Such suspension shall not affect any accessory penalty or preventive measure resulting from the conviction.\n3. Where within the period so fixed, calculated from the date when the judgment becomes final, the offender commits a further felony or misdemeanour for which he is sentenced to imprisonment, and where such sentence is not suspended on probation, both sentences shall be served consecutively, that which has been suspended under this Section being served first.\n4. The expiry of the said period shall otherwise produce the effects of rehabilitation provided for by Section 676 of the Criminal Procedure Code.\n"}, "SECTION 55": {"title": "WHERE APPLICABLE", "content": "1. In any case where a sentence of 6 (six) months or more of imprisonment may be suspended, suspension may be combined with probation.\n2.  When combined with probation suspension may also be granted to an offender with a previous sentence of imprisonment suspended without probation or with a previous sentence of imprisonment for less than 6 (six) months not suspended.\n3. The period of probation may not be less than 3 (three) nor more than 5 (five) years.\n4.  Subject to subsections (1) and (2), Section 54 of this Code shall apply to suspension on probation.\n"}, "SECTION 56": {"title": "MEANING OF PROBATION", "content": "1. Probation shall mean the subjection of the offender to general and, in a fit case, to added special obligations of supervision and assistance. \n2. The offender’s compliance with his obligations shall be superintended by a Magistrate nominated in that behalf, with the assistance of salaried or honorary probation officers.\n3. The probation officer shall be chosen and may be replaced by the Magistrale in charge\n4. The Magistrate in charge at the offender's residence may at any time for reasons to be recorded in writing suspend ail or any of the special obligations or vary them, but not so as to make them more burdensome.\n"}, "SECTION 57": {"title": "GENERAL OBLIGATIONS", "content": "An offender on probation shall always be subject to the general obligations prescribed by Section 41 of this Code, save that for the supervisor shall be substituted the probation officer.\n"}, "SECTION 58": {"title": "SPECIAL OBLIGATIONS", "content": "In addition to the general obligations prescribed by the last preceding Section, the judgment may subject the offender to one or more of the special obligations described by Section 42.\n"}, "SECTION 59": {"title": "DUTIES OF PROBATION OFFICER", "content": "1. The probation officer shall be bound to satisfy himself that the offender observes the general and special obligations of his probation, and in addition to stimulate and encourage the offender's efforts in the direction of reform, in particular his family and occupational readaptation.\n2. He shall be bound to afford the offender ail moral support in his power, and it shall be his duty, where the offender is in need of Financial support, to apply to the Magistrale in charge to approach any social assistance organization with a view to a grant.\n3. He shall report regularly to the said Magistrale on the progress of his task, and shall refer to him in case of difficulty.\n"}, "SECTION 60": {"title": "BREACH OF OBLIGATIONS", "content": "1. Where during the period of probation the offender shall have broken any general or special obligation, the court which suspended the sentence may order its enforcement.\n2. Such order shall not carry with it revocation of any previous suspension without probation.\n3. Where a suspended sentence has not been revoked under this Section or Section 54 of this Code, the expiry of the period shall produce the effects provided for in Section 676 of the Criminal Procedure Code\n"}, "SECTION 61": {"title": "DEFINITION", "content": "1. Release on licence shall mean the premature release of a person sentenced to loss of liberty, or subjected, by a conviction decision, to a similar preventive measure. Such release on licence shall be granted and revoked by decree.\n2. The general conditions and detailed procedure for grant and revocation of release on licence shall be prescribed by decree.\n3. Premature release of an offender, where not revoked, shall become final upon expiry of the term of sentence.\n"}, "SECTION 62": {"title": "SUSPENSION OF MEASURES", "content": "1. The decree granting release on licence also suspends enforcement of any order of confinement in a special health establishment, or of preventive confinement, or of post-penal supervision and assistance, or of banned occupation which would follow on release from the principal penalty.\n2. Such suspension shall become definitive 5 (five) years after the expiry of the principal penalty.\n"}, "SECTION 63": {"title": "TIME FOR GRANT", "content": "1. Release on licence from a principal penalty may not be granted before service of ha If the sentence, or of the aggregate of consecutive sentences, regard being had to remissions if any. It may not be granted to a recidivist before service of two-thirds of the sentence.\n2. A person under preventive confinement may not be granted release on licence before service of 5 (five) years of the sentence.\n"}, "SECTION 64": {"title": "REVOCATION", "content": "1. Release on licence may be revoked on conviction for felony or misdemeanor later committed or for breach of any of the general or special conditions of the licence.\n2. In case of revocation the period of liberty shall not be counted in the duration of the sentence.\n"}, "SECTION 65": {"title": "SUSPENSION OF POST-PENAL MEASURES", "content": "1. On the proposai of the authority contemplated by Section 40 (2), the court which has ordered post-penal measures, may at any time, for reasons to be recorded in the order, suspend ail or any of the special obligations imposed, or vary them, but not so as to make them more burdensome.\n2. Such suspension may at any time in like manner be revoked\n3. The duration of such suspension, whether or not revoked, shall be counted in the duration of the measures.\n"}, "SECTION 66": {"title": "PARDON", "content": "Pardon shall mean the commutation or remission, in whole or in part and with or without conditions, of a penalty or preventive measure or of the obligations of a probation order.\n"}, "SECTION 67": {"title": "PRESCRIPTION", "content": "1. Where a principal penalty has remained unenforced for the following periods after judgment has become final, neither it nor any accessory penalty or preventive measure accompanying it may any longer be enforced:\n   - for felony : 20 (twenty) years ;\n   - for misdemeanour and simple offence tried with misdemeanour: 5 (five) years ;\n   - for any other simple offence; 2 (two) years.\n2. Prescription shall be suspended while enforcement of the sentence is prevented by any consideration of law or of fact apart from the offender’s will.\nTime shall begin to run again on the intervention of an enforcement measure taken before the completion of the period.\nA person convicted in default may no longer appear to serve his sentence after prescription\n"}, "SECTION 68": {"title": "DEATH", "content": "The offender's death shah not prevent enforcement of pecuniary sentences against his estate or closure of an establishment, or confiscation.\n"}}}, "CHAPTER 8": {"title": "EXPUNGEMENT OF THE CONVICTION", "sections": {"SECTION 69": {"title": "DEFINITION AND EFFECT", "content": "1. Rehabilitation is a measure which, unless otherwise provided by law, expunges a conviction for felony or misdemeanour. It puts an end to any accessory penalty and to any preventive measure except to confinement in a health institution and closure of an establishment.\n2. Where a person has been convicted more than once, rehabilitation shall apply to ail the convictions.\n3. Rehabilitation shall be as of right or by court judgment\n4. \n   - In order to be rehabilitated, an offender shall show proof of payment of ail costs and damages or of any reduction thereof granted him. Otherwise, he shall prove that he served an imprisonment term in default of payment.\n   - Where he is convicted of fraudulent bankruptcy, he shall prove the discharge of his liabilities relating to capital, interest and expenses or prove that a reduction was granted him.\n   - Where the civil party cannot be found, the amount due him shall either be paid to his representative or, otherwise, into the deposit and guarantee fund.\n   - Where the offender claims that the civil party has refused the amount due him, he shall show proof of such refusal and pay the said amount into the deposit and guarantee fund.\n   - The four-year prescription shall not be applicable hereto.\n  \n5. \n   - Rehabilitation shall not as of right restore any decoration forfeited nor automatically reinstate the person rehabilitated in any orders from which he would have been debarred;\n   - Police supervisor and security measures against the offender\n   shall remain enforceable.\n   - Amounts paid in satisfaction of pecuniary sentences and\n   confiscations from the person rehabilitated shall remain with the Public Treasury and shall be non-refundable;\n   - Rehabilitation shall not as of right reinstate anyone in public office or employment, rank, public or ministerial positions nor shall it give rise to any reconstitution of his career.\n   However, the person rehabilitated shall regain the rights forfeited such as parental authority, guardianship, electoral rights and the right to appear as a witness in court.\n   - Rehabilitation shall not bar an application for review of judgment with a view to establishing innocence.\n"}, "SECTION 70": {"title": "REHABILITATION AS OF RIGHT", "content": "1. An offender who has not had any further sentence of imprisonment for felony or misdemeanour shall as of right be rehabilitated upon expiry of the following periods:\n   - Five (5) years, for a sentence of fine;\n   - ten (10) years for a single sentence of imprisonment of up to six months ;\n   - fifteen (15) years for a single sentence of up to two years ;\n   - twenty (20) years for a single sentence of up to five years.\n2. The period shall be 15 (fifteen) years for an aggregate sentence of more than 1 (one) year but not more than 2 (two) years.\n3. Sentences ordered to run concurrently shall be counted as a single sentence.\n4. The said periods shall run, in the case of a sentence of fine, from the date of payment or of prescription, and in the case of loss of liberty, from the date of expiry of the sentence, taking into consideration any remission or prescription.\n5. The partial or total remission of a sentence shall amount to its partial or total execution.\n"}, "SECTION 71": {"title": "REHABILITATION BY COURT", "content": "1. Any offender may apply to the court for rehabilitation\n2. Rehabilitation may only be applied for after 5 (five) years in the case of a conviction for felony and after 3 (three) years in the case of a convictionfor misdemeanour. These time-limits shall run from the date following the day of his release in the case of a sentence to loss of liberty, or payment in the case of a fine.\n3. The time-limit prescribed in Subsection (2) above shall be doubled in the case of persons with a previous conviction\n"}, "SECTION 72": {"title": "REHABILITATION AFTER DEATH", "content": "1. In the case of death of the offender, the application may be followed up or even filed by his spouse, his ascendants or his descendants.\n2. In the case of death of the applicant, any application for rehabilitation already filed may be continued by the Legal Department.\n"}, "SECTION 73": {"title": "EFFECTS OF AMNESTY", "content": "1. Without prejudice to any civil right, an amnesty shall expunge a conviction and shall put an end to the enforcement of all penalties, whether principal or accessory, and of ail preventive measures pronounced in consequence of the conviction, save confinement in a health institution and closure of an establishment.\n2. Unless otherwise expressed, an amnesty shall bar the commencement or continuation of any prosecution.\n3. Unless so expressed, an amnesty shall not relieve of the liability for any expenses due to the Treasury in respect of a conviction which has become final.\n4. Unless so expressed, it shall not affect the right of the Treasury to any sums already collected in satisfaction of expenses, fines or confiscation.\n5. Unless so expressed, it shall by itself neither restore to any decoration nor restore to any order forfeited.\n6. Unless so expressed it shall not of itself restore to any public service employment or office, and shall give no right to restoration to the position in a public service which, but for the conviction, would have been attained.\n7. It shall be no oar to an application for revision with a view to\nestablishing innocence in fact.\n"}}}}}, "PART III": {"title": "CRIMINAL RESPONSIBILITY OF NATURAL PERSONS AND CORPORATE BODIES", "chapters": {"CHAPTER 1": {"title": "GENERAL PROVISIONS", "sections": {"SECTION 74": {"title": "PUNISHMENT AND RESPONSIBILITY", "content": "1. No penalty may be imposed except upon a person criminally responsible.\n2. Criminal responsibility shall lie on him who intentionally commits each of the ingredient acts or omissions of an offence with the intention of causing the result which completes it.\n3. Save as otherwise provided by law, no criminal responsibility shall arise from the result, though intended, of an omission.\n4. Save as otherwise provided by law, there shall be no criminal responsibility unless subsection (2) of this Section has been satisfied.\nProvided that responsibility for a simple offence shall not require any intention to act or to omit or to cause the result.\n"}, "SECTION 74-1": {"title": "CRIMINAL RESPONSIBILITY OF CORPORATE BODIES", "content": "- a) Corporate bodies shall be criminally responsible for offences committed on their behalf by their organs or representatives.\n- b) The provisions of the subsection (a) above shall not apply to the State and its agencies.\n- c) The criminal responsibility of natural persons who are authors of reprehensible acts may be compounded with that of corporate bodies.\n"}, "SECTION 75": {"title": "IGNORANCE OF LAW AND MOTIVE", "content": "Neither ignorance of the law nor motive shall be material to criminal responsibility\n"}, "SECTION 76": {"title": "EXECUTION OF THE LAW", "content": "No act or omission in execution of the law or authorized by law, and performed in accordance with the conditions prescribed by law shall constitute an offence.\n"}}}, "CHAPTER II": {"title": "IRRESPONSIBILITY AND DIMINISHED RESPONSIBILITY", "sections": {"SECTION 77": {"title": "ACCIDENT AND PHYSICAL COMPULSION", "content": "No criminal responsibility shall arise from accident or from irresistible physical compulsion.\n"}, "SECTION 78": {"title": "INSANITY", "content": "1. No criminal responsibility shall arise from the act or omission of a person suffering from mental illness which deprives him of ail will-power or of the knowledge that what he does is blameworthy. \n2.  Mental illness whose consequences are only partial shall diminish responsibility.\n"}, "SECTION 79": {"title": "INTOXICATION", "content": "Involuntary intoxication shall have the same effect as mental illness.\n"}, "SECTION 80": {"title": "INFANCY", "content": "1. No criminal responsibility shall arise from the act or omission of a person aged less than 10 (ten) years. \n2.  An offence committed by a person aged not less than 10 (ten) years and less than 14 (fourteen) years may attract only such special measures as may by law be provided.\n3. For an offence committed by a person aged over 14 (fourteen) and under 18 (eighteen) years. responsibility shall be diminished.\n4. A person aged 18 (eighteen) years or over shall be responsible as\nan adult.\n5.  The age relevant to this Section shall be that attained at the date of commission.\n"}, "SECTION 81": {"title": "THREATS", "content": "1. No criminal responsibility shall arise from submission to threats, not otherwise avoidable, of imminent death or of grievous harm as defined by this Code\nProvided that where the act committed is defined as an offence punishable with death or has resulted in death or in grievous harm, the responsibility of the person committing the act shall be merely diminished.\n2. This Section shall not apply to a person who has voluntarily exposed himself to the risk of such threats.\n"}, "SECTION 82": {"title": "COMPULSION", "content": "Responsibility shall be diminished for an offence committed\n- a) By a person aged less than 18 (eighteen) years under the compulsion of his parents or of the person having charge of him, or responsible for him under customary law ;\n- b) By an employee or subordinate under the compulsion of his employer or superior.\n"}, "SECTION 83": {"title": "OBEDIENCE TO LAWFUL AUTHORITY", "content": "1. No criminal responsibility shall arise from an act performed on the orders of a competent authority to whom obedience is lawfully due.\n2. This Section shall not apply where the order is manifestly unlawful.\n"}, "SECTION 84": {"title": "LAWFUL DEFENCE", "content": "1. No criminal responsibility shall arise from an act dictated by the immediate necessity of defence of the person acting or of any other person, or of any right of himself or of any other, against an unlawful infringement:\n2. No criminal responsibility shall arise from an act dictated by the immediate necessity of defence of the person acting or of any other person, or of any right of himself or of any other, against an unlawful infringement:\nProvided that the means of defence be proportionate to the seriousness of the infringement threatened.\n3. Intentional killing shall be proportionate to an attack causing a reasonable apprehension of death, of grievous harm as defined by this Code of rape or of sodomy.\n"}, "SECTION 85": {"title": "PROVOCATION", "content": "1. Responsibility shall be diminished for an offence immediately provoked by the unlawful act of another against the offender or, in his presence. against his spouse, descendant or ascendant, brother or sister, employer or employee, or a minor or incapable in his charge.\nProvided that the reaction be proportionate to the provocation.\n2. Intentional killing or wounding shall be proportionate to a provocation by violent blows or injuries.\n3. Intentional killing or wounding of a spouse or of his or her lover shall be proportionate to the provocation of finding them in the act of adultery.\n4. In order to diminish responsibility provocation must be of a kind to deprive an ordinary person of self-controL\n"}, "SECTION 86": {"title": "STATE OF NECESSITY", "content": "No criminal responsibility shall arise from an infringement of a right of property, not justified as lawful defence under Section 84, but inflicted in order to protect the person acting or any other person, or his or another's property, from a grave and imminent danger not otherwise avoidable. Provided that the means of protection be proportionate to the harm.\n"}, "SECTION 87": {"title": "EFFECT OF DIMINISHED RESPONSIBILITY", "content": "1. Wherever responsibility is by law diminished, the penalty provided for the offence shall be reduced as follows;\n   - a) The penalty of death or of loss of liberty for life shall be reduced to loss of liberty for from 2 (two) to 10 (ten) years;\n   - b) Any other penalty for felony shall be reduced to loss of liberty for from 1 (one)to 5 (five) years;\n   - c) The maximum penalty for misdemeanour, whether of loss of liberty or of fine, shall be reduced by half, and the minimum to that provided Section 92 (1) of this Code.\n2. Where responsibility is reduced for more than one reason or where there are in addition mitigating circumstances. the minimum shall be that provided by Section 92 (1 ).\n"}}}, "CHAPTER III": {"title": "AGGRAVATION QF CRIMINAL RESPONSIBILITYQF NATURAL PERSONS AND CORPORATE BODIES", "sections": {"SECTION 88": {"title": "PREVIOUS CONVICTIONS OF NATURAL PERSONS AND CORPORATE BODIES", "content": "1. A recidivist shall be:\n   - a) Any natural person or corporate body who, having been convicted for a felony or misdemeanour, commits another simple offence classified as felony or misdemeanour within the time-limit running from the date of final conviction and which expires 5 (five) years after the execution or expiry of the sentence ;\n   - b) Any natural person or corporate body who, having been convicted for a simple offence commits another simple offence within the time-limit running from the date of final conviction, which expires 12 (twelve) months after the execution or expiry of the sentence.\n2. In case of recidivism, the maximum penalty provided for shall be doubled.\n"}, "SECTION 89": {"title": "PUBLIC SERVANTS", "content": "1. Subject to any special penalties provided for felonies or misdemeanours committed by national, foreign or international public servants, national, foreign or international public officers or national, foreign or international officials, the fact of being a public servant established or otherwise shall aggravate the responsibility of any such person guilty of any other felony or misdemeanour against which it is his duty to guard or to take action.\n2. In case of aggravating circumstances, the maximum penalty provided for shall be doubled.\n"}}}, "CHAPTER IV": {"title": "MITIGATION AND SELECTION OF SENTENCE", "sections": {"SECTION 90": {"title": "MITIGATION", "content": "The benefit of mitigating circumstances may be given, for reasons to be\nrecorded in the judgment, save where they are by law expressly excluded.\n"}, "SECTION 91": {"title": "MITIGATION IN CASE OF FELONY", "content": "1. Upon a finding of mitigating circumstances in favour of any person convicted of felony, the sentence may be reduced to not less than 10 (ten) years' loss of liberty if the offence be punishable with death, to not less than 5 (five) years if it be punishable with loss of liberty for life, and to not less than 1 (one) year in any other case.\n2. Where the penalty is reduced under the last subsection to 10 (ten) years or less the court may add a fine of up to CFAF 2 000 000 (two million).\n"}, "SECTION 92": {"title": "MITIGATION IN OTHER CASES", "content": "1. Upon a finding of mitigating circumstances after conviction of misdemeanour or of a simple offence, the court may reduce to 5 (five) days any sentence of loss of liberty. and any sentence of fine to CFAF 1 (one). and may pass sentence of one such penalty only.\n2. Where the offence is by law punishable with loss of liberty only, the court may substitute a fine of up to CFAF 1 000 000 (one million) for misdemeanour or up to CFAF 25 000 (twenty-five thousand) for a simple offence.\n"}, "SECTION 93": {"title": "SELECTION OF SENTENCE", "content": "Sentence of penalty or measure shall vary, within such limits as may be prescribed or authorized by law, according to the circumstances of the offence. and to the public danger which it may represent. to the circumstances of the offender and to the likelihood of his reformation, and to the practical means of carrying it out.\n"}}}, "CHAPTERV": {"title": "ATTEMPT AND CONSPIRACY", "sections": {"SECTION 94": {"title": "ATTEMPT", "content": "1. An attempt to commit a felony or misdemeanour shall mean the performance of any act towards its commission unambiguously indicating an irrevocable intention to commit it, and shall be treated. where execution has been arrested or has failed solely by reason of circumstances independent of the offender's will, as the commission of the felony or misdemeanour attempted.\n2. An attempt shall be punishable notwithstanding that complete execution was impossible by reason of a circumstance of fact unknown to the offender.\n3. Mere preparation shall not constitute an offence\n"}, "SECTION 95": {"title": "CONSPIRACY", "content": "1. Conspiracy shall mean the resolve concerted and determined between 2 (two) or more persons to commit an offence.\n2. There can be no conspiracy between husband and wife.\n3. Conspiracy to commit a felony or misdemeanour shall be treated, where execution has failed solely by reason of circumstances independent of the conspirators’ joint will as the commission of the felony or misdemeanour resolved.\n4. The responsibility of a conspirator voluntarily withdrawing from the conspiracy before execution has commenced shall be diminished.\n5. No penalty may be imposed upon a conspirator who prevents the execution of the offence resolved or who before any attempt at execution informs the administrative or judicial authorities of the conspiracy\n"}}}, "CHAPTER VI": {"title": "PARTICIPATION", "sections": {"SECTION 96": {"title": "CO-OFFENDERS", "content": "A co-offender shall mean a person who, in agreement with another, takes part with him in the commission of an offence.\n"}, "SECTION 97": {"title": "ACCESSORIES", "content": "1. An accessory shall mean a person who abets the commission of a felony or misdemeanour, that is :\n   - a) who orders or in any manner causes the commission of an act or omission so defined; or\n   - b) who aids or facilitates the preparation or the commission of such an offence.\n2. Attempted abetment shall be treated as abetment.\n"}, "SECTION 98": {"title": "PUNISHMENT OF CO-OFFENDERS AND ACCESSORIES", "content": "1. Subject to any special provision of law, a co-offender and an accessory shall be punishable in like manner as a sole or principal offender.\n2. Circumstances resulting in the irresponsibility of any person, or in his exemption from punishment or reduction or increase of his punishment, shall, where Personal, affect only the person concerned.\n3. Circumstances other than Personal shall affect any co-offender or accessory who could have foreseen them.\n"}, "SECTION 99": {"title": "FORESEEABLE CONSÉQUENCES", "content": "1. Any co-offender or accessory to the commission or attempted commission of a felony or misdemeanour shall also be responsible in respect of any other offence committed or attempted as a foreseeable conséquence of the agreement or abetment.\n2. Any person habitually furnishing places of refuge or assembly to malefactors of whose felonious conduct he is aware shall also be liable to punishment as their accessory.\n"}, "SECTION 100": {"title": "ACCESSORY AFTER THE FACT", "content": "1. An accessory after the fact shall mean a person who after the commission of a felony or misdemeanour shelters an offender or his accessories from arrest or from investigation, or who has custody of or disposes of anything taken, misappropriated or otherwise obtained by means of the offence.\n2. This Section shall not apply as between husband and wife.\n3. An accessory after the fact shall be punished under special\nprovisions of law.\n"}}}}}, "PART IV": {"title": "STATE LAWS", "chapters": {"CHAPTER 1": {"title": "STATE LAWS", "sections": {"SECTION 101": {"title": "BREACH OF STATE LAWS AND OTHERS", "content": "1. Where any law of either Federated State expressly so provides, any breach of such law which is not defined or punishable under this Code or any other federated law shall be punished with imprisonment for up to 1 (one) year or with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 500 000 (five hundred thousand) or with both such imprisonment and fine.\n2. Breach of any order lawfully issued under such law shall constitute a simple offence.\n"}}}}}}, "Book II": {"PART I": {"title": "FELONIES AND MISDEMEANOURS AGAINST THE STATE", "chapters": {"CHAPTER1": {"title": "THE SECURITY OF THE STATE", "sections": {"SECTION 102": {"title": "HOSTILITIES AGAINST THE FATHERLAND", "content": "Any citizen:\n- a) taking part in hostilities against the Republic;\n- b) or assisting or offering to assist the said hostilities; shall be guilty of treason and punished with death.\n"}, "SECTION 103": {"title": "OTHER FELONIES PUNISHABLE WITH DEATH", "content": "Shall, if a citizen, be guilty of treason and, if a foreigner, be guilty of espionage, and shall in either case be punished with death whoever:\n- a) instigates a foreign power to undertake hostilities against the Republic; or\n- b) surrenders or offers to surrender to 3 foreign power or to its agents any troops. territory installations or equipment employer in the defence of the nation, or any dAlrightefence secret, or who in whatever manner acquires\nsuch a secret with intent to surrender it to a foreign power,\n- c) with intent to injure the defence of the nation, damages any\nconstruction, installation or equipment, or commits any malpractice\nliable to prevent their normal working or to lead to an accident.\n"}, "SECTION 104": {"title": "PENALTIES OF ORDINARY LAW", "content": "On reduction of the penalty provided by Sections 102 and 103, any loss of liberty shall be imprisonment.\n"}, "SECTION 105": {"title": "PREJUDICE PUNISHABLE WITH TEN YEARS", "content": "Shall be punished with imprisonment for from 1 (one) to 10 (ten) years or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 10 000 000 (ten million), or with both such imprisonment and fine whoever in time of peace:\n1. otherwise than in order to surrender it to a foreign power, acquires a defence secret, or reveals such secret to a person not entitled to know it ;\n2. with intent to surrender them to a foreign power collects information, articles, documents or processes, where advantage could be taken of such collection to injure the defence of the nation ;\n3. intrudes by any deceitful means into any installation, ship, aircraft or vehicle employed in the defence of the nation ;\n4. carries out any drawing, survey or photographic or topographical operation within any defence installation or within any prohibited area around it as laid down by the defence authorities and without their permission ;\n5. loiters within a fixed distance prohibited by competent authority around a defence installation ;\n6. flies without permission in a foreign aircraft over the territory of the Republic;\n7. . sets up secretly a means of correspondence or of long distance transmission liable to injure the defence of the nation ;\n8. by any activity not approved by the Government exposes the Republic to reprisals ;\n9. enlists or undertakes training, without prior permission of the competent Cameroon authorities in the Armed Forces or Police Forces of a\nforeign country and engages in activites injurious to the defence of the nation or in activites capable of eventually exposing the Republic to a rebellion or an insurrection.\"\n"}, "SECTION 106": {"title": "PREJUDICE PUNISHABLE WITH FIVE YEARS", "content": "Shall be punished with imprisonment for from 1 (one) to 5 (five) years or with fine of from CFAF 50 000 (fifty thousand) to CF AF 5 000 000 (five million), or with both such imprisonment and fine whoever in time of peace:\n1. carries on with the agents of a foreign power a course of communication liable to injure the defence or diplomatic position of the Republic ;\n2. Within the territory of the Republic and without the permission of the Government recruits or enlists any person for any foreign armed forces ; or\n3. by any activity not approved by the Government exposes any citizen to reprisals; or\n4. without permission from the Government surrenders or communicates to a foreign power or its agents any invention connected with the defence of the nation, or any information, study or process regarding such an invention, or any industrial application connected with the defence of the nation; or\n5. by rashness, carelessness. or breach of any regulation, permits the removal or observation, whether in whole or in part, and for however short a time, of any article, equipment, document or information entrusted to him or in his care, and knowledge of which is liable to lead to the discovery of a defence secret; or\n6. by rashness, carelessness, or breach of any regulation permits the damage or destruction of any object, equipment or document entrusted to him or in his care, where such damage or destruction is prejudiciai to the defence of the nation; or\n7. being in control of any supplies, concern or undertaking on behalf of the armed forces, or being agent for any supplier or a subcontractor, causes the service to fail or to be delayed, be it merely by carelessness; or\n8. being in control of any supplies, concern or undertaking on behalf of the armed forces commits a fraud in respect of the description, the quality or the amount of works, of labour or of articles supplied.\n9. enlists undertakes training without prior permission of the competent Cameroon authorities. in the Armed Forces or Police Forces of a foreign country »\n"}, "SECTION 107": {"title": "FAILURE TO REPORT", "content": "Any citizen who in time of peace fails to inform the defence, administrative or legal authorities, so soon as he comes to know of it, of any activity liable to injure the defence of the nation shall be punished as under the last foregoing Section.\n"}, "SECTION 108": {"title": "WARTIME", "content": "1. Any citizen or resident who in time of war and without permission from the proper authority\n- a) carries on any correspondent or relations with the subjects or agents of the enemy; or\n- b) concludes, directly or indirectly, any business transaction with a subject or agent of the enemy, or with any person residing in his territory.\n1. Shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years Whoever in time of war:\n- a) joins in any undertaking to spread alarm and despondency in the defence forces or in the nation, with intent thereby to injure the defence of the nation; or\n- b) commits any offence described by Sections 105, 106 or 107.\n1. Shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years. Whoever in time of war commits any act of any kind liable to injure the defence of the nation shall, if no higher penalty be provided, be punished with imprisonment for from 1 (one) to 5 (five) years, or with fine of from CFAF 50 000 (fifty thousand) to CFAF 5 000 000 (five million), or with both such imprisonment and fine.\n2. For the purposes of subsections 2 and 3 of this Section, any state of emergency, mobilization or siege shall be treated as time of war.\n"}, "SECTION 109": {"title": "DEFENCE SECRET", "content": "For the purposes of this Code a detence secret shall mean any\ninformation of whatever kind liable to assist hostile undertakings against the Republic and not already made public.\n"}, "SECTION 110": {"title": "EXTENSION TO FOREIGN POWER", "content": "The provisions of the foregoing Sections may be extended by decree so as to apply in like manner to acts committed against foreign powers.\n"}, "SECTION 111": {"title": "SECESSION", "content": "1. Whoever undertakes in whatever manner to infringe the territorial integrity of the Republic shall be punished with imprisonment for life. \n2.  In time of war, or in a State of emergency or siege the penalty shall be death.\n"}, "SECTION 112": {"title": "CIVIL WAR", "content": "Whoever provokes civil war by arming the people, or by inciting them to take arms against each other, shall be punished with death.\n"}, "SECTION 113": {"title": "PROPAGATION OF FALSE INFORMATION", "content": "Whoever sends out or propagates false information liable to injure public authorities or national unity shall be punished with imprisonment for from 3 (three) months to 3 (there) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 2 000 000 (two million).\nOn reduction of the penalty provided by Sections 111 (2) and 112, any loss of liberty shall be imprisonment.\n"}, "SECTION 114": {"title": "REVOLUTION", "content": "Whoever by force attempts to alter the laws composing the Constitution, or to overturn the political authorities set up by the said laws or to render them incapable of exercising their powers shall be punished with imprisonment for life.\n"}, "SECTION 115": {"title": "ARMED BAND", "content": "1. Whoever, with mtent to commit a felony defined oy Sections 111\n112 and 114, or to hinder the operations of the forces of order against those committmg any such felony, forms an armed band, or holds any office or command in it or joins in such band's commission of or attempt to commit\nsuch felony shall be punished with impnsonment for life.\n2. Any other member of such band shall be punished with imprisonment for from 10 (ten) to (twenty) years. \n3. For the purposes of this Section an armed band shall mean any gathering of 5 (five) or more persons of whom any one bears any arm, open orconcealed.\n4. The provisions of Section 95 (5) of this Code shall apply to this Section.\n"}, "SECTION 116": {"title": "INSURRECTION", "content": "Whoever during an insurrection: \n- a) instigates or encourages by whatever means the gathering of the insurgent; or\n- b) hinders by whatever means the summoning, the assembly or the operations of the forces of order, or usurps their command; or\n- c) invades or destroys any public or private building; or\n- d) holds or seizes any weapon, ammunition or explosives ; or\n- e) wears any official uniform, garb or emblem, whether civil or military, shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\n"}, "SECTION 117": {"title": "WEAPONS", "content": "For the purposes of the foregoing Section a weapon shall include both an arm properly so called and any other article carried with intent thereby to inflict bodily harm or material damage.\n"}, "SECTION 118": {"title": "SPECIFIC CONFISCATION", "content": "On conviction for any felony or misdemeanour defined by this Chapter the confiscation prescribed by Section 35 of this Code shall be ordered and may also be extended to property not belonging to the offender.\n"}, "SECTION 119": {"title": "CONFISCATION OF UNLAWFUL PROPERTY", "content": "1. Upon conviction for any felony or misdemeanour defined by this Chapter, the Court may order confiscation of the offender's property, of whatever nature and whether or not held jointly, to which he can show no lawful title.\n2.  In time of war such confiscation shall always be ordered.\n"}, "SECTION 120": {"title": "GENERAL CONFISCATION", "content": "Upon conviction for any felony defined by this Chapter the Court may in addition order the confiscation of ail or part of the offender's property lawfully acquired.\n"}, "SECTION 121": {"title": "FORFEITURE", "content": "1. Upon conviction for a felony defined by this Chapter the duration of the forfaitures described in Section 30 may not be reduced below 5 (five) years.\n2. Upon conviction for a misdemeanour and sentence under this Chapter to loss of liberty the Court may order such forfeiture for not less than five nor more than 10 (ten) years. \n3. The duration of the post-penal measures described in Section 40 of this Code may be extended to 10 (ten) years.\n4.  Where the offender, in case either of felony or misdemeanour, is an officer or official of the public service or a member of the armed forces, the disqualification from public service may be for life.\n"}}}, "CHAPTER II": {"title": "OFFENCES AGAINST THE CONSTITUTION", "sections": {"SECTION 122": {"title": "ELECTORAL FRAUD", "content": "1. Whoever \n- a) registers on electoral registers using a false identrty or who, during registration, conceals the tact that he has been:\n- - convicted for an offence, even in default ;\n- - sentenced to an imprisonment term of more than 3 (three) months without suspension;\n- - sentenced to an imprisonment term of more than 6 (six) months with suspension or probation;\n- - the subject of an arrest warrant;\n- - bankrupt, not rehabilitated and whose bankruptcy has been declared either by a Cameroonian court or by a judgment rendered abroad and enforceable in Cameroon;\n- b) through false statements or certificates, registers himself unduly on an electoral register or who, through the same means, unduly registers or cancels the name of a citizen ;\n- c) upon losing his right to vote, participates in the poll ;\n- d) votes, either by virtue of a false registration or by using the name and capacity of other registered voters ;\n- e) votes several times, following multiple registrations ;\n- f) charged during an election with receiving and counting the vote of citizens, subtracts, adds or modifies the ballot papers or includes a name that is not registered ;\n- g) through false information, slanderous statements or any other fraudulent acts, cancels or diverts votes or causes one or several voters to abstain from the vote ;\n- h) before or after the poll, failing to comply with legislative or regulatory provisions or through any other fraudulent act violates secrecy of the poll, prejudices its fairness, breaches the conduct of the poll and modifies the results thereof ;\n- i) is found guilty of fraudulent acts in the issuance or production of certificates of registration or striking off from electoral registers ;\n- ]) uses personal data contained in the electoral register for purposes other than elections ;\n- K) on polling day with or without violence, is found to be the author or an accessory of the stealing of a ballot box or any other election material.\nshall be punished with imprisonment of from 3 (three) months to 2 (two)\nyears or a fine of from CFAF 50 000 (fifty) to CF AF 500 000 (five hundred thousand) or with both such imprisonment and fine;\n1. Where the author of the offence or his accessory is a public servant, as defined under Section 131 of this Code, he shall be liable to imprisonment of from 1 (one) to 5 (five) years.\n"}, "SECTION 123": {"title": "CORRUPTION AND VIOLENCE IN ELECTION MATTERS", "content": "Whoever:\n- a) through menacing gatherings, clamours or demonstrations, disrupts election operations or infringes the exercise of the right or freedom to vote ;\n- b) On polling day, is found guilty of insult or violence against the local polling commission or any of its members, or through assault or threats, delays or obstructs election operations;\n- c) through gifts, generosity, favours, promise of public or private employment or any other specific benefits offered with the purpose of influencing the vote of one or several electors, obtains their vote, either directly or through a third party;\n- d) directly or through a third party. accepts or requests from candidates the above-mentioned gifts, generosity, favours or benefits;\n- e) through assault. violence or threats against an elector, either by making him fear to lose his job or expose himself, his family or fortune to danger, influences his vote,\nshall be punished with imprisonment for from 3 (three) months to 2 (two) years or with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand) or with both such imprisonment and fine.\n"}, "SECTION 123-1": {"title": "WEAPONS DURING ELECTIONS", "content": "1. Any person who enters a polling station with a visible weapon shall be punished with imprisonment for from 10 (ten) days to 2 (two) months or with a fine of from CFAF 25 000 (twenty-five thousand) to CFAF 250 000 (two hundred and fifty thousand) or with both such imprisonment and fine.\n2. The imprisonment term may be extended to 4 (four) months and the fine to CFAF 500 000 (five hundred thousand) if the weapon is hidden.\n"}, "SECTION 123-2": {"title": "POLITICAL DEMONSTRATIONS DURING THE ELECTORAL PERIOD", "content": "1. Any activity or manifestation of a political character snail be prohibited within public establishments as well as in school and university establishments.\n2. Any infringement of the provisions of Subsection 1 above shall be punished with imprisonment for from ten (10) days to four (4) months or with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 250 000 (two hundred and fifty thousand) or with both such imprisonment and fine.\n"}, "SECTION 123-3": {"title": "MISAPPROPRIATION OF PUBLIC FUNDS IN ELECTION MATTERS", "content": "Whoever, acting on his Personal behalf or on behalf of a political party, uses funds received in the context of public funding for purposes other than those provided for under the Law relating to the Electoral Code, shall be liable to with the punishment provided for in Section 184 of the Penal Code.\n"}, "SECTION 123-4": {"title": "CRIMINAL PROCEEDINGS IN ELECTION MATTERS", "content": "Save in case of flagrante delicto, no criminal proceedings shall be instituted against a candidate for infringement of any of the provisions of Book Il Part I Chapter 2 (A) of this law before the proclamation of the election results.\n"}, "SECTION 124": {"title": "AGAINST THE LAW, THE OPERATION OF A PUBLIC SERVICE, OR THE SECURITY OF THE STATE", "content": "1. Any person in whom is vested any part of public authority, and any public servant, who with any other such person concerts or determines: \n- - any measure contrary to law or to any regulation lawfully issued thereunder; or\n- - any measure, including collective resignation, designed primarily to obstruct or to interrupt the carrying on of a public service.\nShall be punished with detention for from 6 (six) months to 3 (three) years.\n1. Where the concert is between ’he civil and military authorities the punishment shall be imprisonment for from (one) to 10 (ten) years.\n2. Where the object of the concert described in the last preceding subsection is a felony against the security of the State the punishment shall be death.\n"}, "SECTION 125": {"title": "ON LEGISLATURE", "content": "Any public servant who:\n- a) assumes the exercise of legislative power ;\n- b) refuses to enforce any provision of law,\nshall be punished with imprisonment for from 6 (six) months to 5 (five) years.\n"}, "SECTION 126": {"title": "BY EXECUTIVE AND JUDICIARY RECIPROCALLY", "content": "Whoever : \n- - being the representative of the executive authority, issues any order or prohibition to any Court; or\n- - being a legal or judicial officer, issues any order or prohibition to any execution or administrative authority - shall be punished with imprisonment for from 6 (six) months to 5 (five) years.\n"}, "SECTION 127": {"title": "BY JUDICIAL OR PARTICULAR IMMUNITIES", "content": "Any judicial, legal or investigating police officer who prosecutes, arrests or tries anyone in violation of any law conferring immunity shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n"}, "SECTION 128": {"title": "UNLAWFUL USE OF FORCE", "content": "Whoever requires or orders the intervention or the use of public force against the enforcement of any provision of law or regulation, or against any lawful order, whether judicial or administrative, shall be punished with imprisonment for from 3 (three) to 10 (ten) years, and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand).\n"}, "SECTION 129": {"title": "NON-COMPLIANCE WITH REQUISITION", "content": "Any commander of any public force who does not comply with a lawful requisition for its use by the civil authorities shall be punished with imprisonment for from 6 (six) months to 2 (two) years\n"}, "SECTION 130": {"title": "FORFEITURES", "content": "On conviction for any misdemeanour under this Chapter the Court may impose for from 5 (five) to 10 (ten) years the forfeitures described by Section 30 of this Code.\n"}}}, "CHAPTER III": {"title": "OFFENCES COMMITTED BY PUBLIC SERVANTS", "sections": {"SECTION 131": {"title": "DEFINITION OF PUBLIC SERVANT", "content": "For the purposes of any criminal law, a public servant shall include, any judicial or legal officer, any law official, any employee or official of the State or of any other body corporate governed by public law, or of a corporation or semi-public corporation, of a law official, any Armed Forces or Gendarmerie serviceman, any employee of the National Security or Prison Administration and any person charged, whether continuously or occasionally with any public duty, mission or task, while acting in the discharge of his office or in relation to the said office.\n"}, "SECTION 131-1": {"title": "FORE IG N OR INTERNATIONAL PUBLIC SERVANT", "content": "For the purposes of this Code, a foreign or international public official shall include any appointed or elected legislative, executive, administrative, or judicial officer of a foreign country, or of a public international organization, and any public service employee of a foreign country or of any other public corporate body.\n"}, "SECTION 132": {"title": "AGGRAVATION FOR PUBLIC SERVANTS", "content": "1. Any public servant who uses force to any person shall be punished, where no heavier punishment is provided, with imprisonment for from six months to five years.\n2. The punishment providea by Sections 189 copying Government\npapers); 206 (licences and similar documents) 207 (official certificates ); 291 (1) (false arrest), 292 (forced labour), 299 (invasion of residence); 300 (tampering with correspondence); 310 (professional secrecy); 315 (forged certificate) shall be doubled where the offender is a public servant.\n"}, "SECTION 133": {"title": "FORFEITURES, CONFISCATION AND PUBLICITY", "content": "1. Upon conviction for any offence defined in this Chapter, or sentence under Section 89 of this Code, the Court may impose on the public servant found guilty the forfeitures described by Section 30 of this Code.\nProvided that the Court shall be bound to impose the forfeitures listed in Section 30 in the cases covered by Sections 134, 134-1, 135, 136 and 161of this Code.\n1. Where sentence is passed for any offence referred to in Sections 134, 134-1, 135, 136 and 161 of this Code, the Court shall be bound to order the confiscation provided for in Section 35 and that its judgment be made known by print, audiovisual and cybernetic media.\n"}, "SECTION 134": {"title": "ACTIVE CORRUPTION", "content": "1. Any national, foreign or international civil servant or public employee who, for himself or for a third party, solicits, accepts or receives any offer, promise, gift or present in order to perform, refrain from performing or postpone any act of his office shall be punished with imprisonment of from 5 (five) to 10 (ten) years or with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million).\n2. he penalty provided for in Subsection 1 above shall be imprisonment for from one to 5 (five) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 1 000 000 (one million) where the act is not part of the duties of the corrupt person but has been facilitated by his position.\n3. Any national or international public official who solicits and accepts any retribution in kind or in cash for himself or a third party, in remuneration for an act that has or has not been performed, shall be punished with the penalties provided for under Sub-section 2 above.\n4. Penalties provided for under Subsections 1 2 and 3 shall be doubled where the offender is a Judicial or Legal Officer a Judicial Police Officer an employee of the institution in charge of the fight against corruption, the head of an administrative unit or any other sworn public servant or employee.\n"}, "SECTION 134 -1": {"title": "PASSIVE CORRUPTION", "content": "1. Whoever makes promises, offers, gifts and presents or yields to requests liable to resuit in corruption in order to obtain either the performance, postponement or abstention from an act or one of the favours or benefits defined in Section 134 above, shall be punished in like manner as under Section 134 (1) above, whether corruption produced its effects or not.\n2. Whoever makes gifts or presents or yields to requests for remuneration for an act performed or deliberately not performed shall be punished with penalties provided for in Section 134 (2) above.\n"}, "SECTION 134-2": {"title": "EXEMPTION FROM CRIMINAL PROCEEDINGS", "content": "In the application of Sections 134 and 134-1 above, criminal proceedings shall not be brought against the person approached provided he reports the acts of corruption to judicial authorities.\n"}, "SECTION 135": {"title": "INTEREST IN GRANT", "content": "1. Any public servant or government employee who takes or accepts any interest, direct or indirect:\n- a) In any grant, contract or selection of tenders subject to his opinion or which he supervised, controlled, administered or drew up; or\n- b) In any private concern, cooperative or corporation in which the State has shares, in any authority or concession subject to his supervision or control; or\n- c) In contracts or agreements signed on behalf of the State or a local authority with a natural person or corporate body; or\n- d) In any business for which it is his duty to authorize payment or liquidation;\nshall be punished with imprisonment for from 1 (one; to 5 (five) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 OOC 000 (two million)\n1. The provisions of this Section shall be applicable to former public servants as defined in Section 131 of this Code who, within 5 (five) years from cessation of duties as a resuit of resignation, dismissal, leave, placement on reserve or retirement or for any other reason having any kind of interest in any grant, operation or concern mentioned above and previously subject to their supervision, control and administration or for whose payment or liquidation they were responsible.\n"}, "SECTION 135-1": {"title": "INSIDER TRADING", "content": "Whoever being : \n- a) a commercial or industrial company manager, or a natural person, who by reason of their duties or professions, has insider information on the situation or prospects of the issuer of stocks and shares whose transferable securities are on the market, performs or knowingly helps to perform either directly or indirectly, transactions before public disclosure of such information, with the objective of obtaining an undue profit;\n- b) a natural person who, in the course of his duties or profession, has access to privileged information on the situation or prospects of the issuer of stocks and shares whose transferrable securities are on the market, and who beyond the scope of his ordinary duties of profession, transmits the information to a third party with a view to obtaining an undue profit;\n- c) natural person, in the exercise of his profession or duties, possesses privileged information that is considered confidential, relating to the implementation of a project by the State, regional and local authority or any other public corporate body, uses the information to his advantage or that of a third party so as to delay the envisioned project or to include additional costs;\nshall be punished with imprisonment for from 6 (six) months to 2 (two) years and with fine of from CFAF 1 000 000 (one million) to CFAF 10 000 000 (ten million) ;\n- d) The punishment shall be doubled where the offender is a civil servant or a public employee as defined by this Code.\n"}, "SECTION 135-2": {"title": "INTERFERENCE WITH THE FINANCIAL MARKET", "content": "1. Any natural person or corporate body who:\n- - rigs the functioning of the market ;\n- - gives undue advantage to persons who would not have had it under normal market conditions ;\n- - violates the right to equal information and treatment of investors or their interests ;\n- - allows issuers and investors to engage in practices contrary to their obligations ;\n- - habitually provides investment services to third parties without authorization ;\n- - carries out negotiations or transactions other than those provided for by the regulations in force on securities listed on the stock market without referring to an investment service provider,\nshall be punished with fine of from CFAF 500 000 (five hundred thousand) to CFAF 5 000 000 (five million).\n1. Any natural person or corporate body who knowingly propagates false or deceptive information on the situation or prospects of an issuer whose securities are on the market such as to influence the prices, or interfere or attempt to interfere, in any manner, with the proper functioning of the market, shall be punished with imprisonment for from 6 (six) months to 2 (two) years or with fine of from CFAF 1 000 000 (one million) to CFAF 10 000 000 (ten million) or with both such imprisonment and fine.\n2. The accessory penalties provided for in Sections 33, 34 and 35 of this Code may also be imposed by the competent court.\n3. The competent court may, in addition, and if need be, impose a fine higher than the amounts provided for in Subsection 1 above and up to ten fold the profit made. The amount imposed shall not be lower than the said profit.\n"}, "SECTION 136": {"title": "INTEREST IN CONCERN", "content": "1. Any person whose duties include the supervision of any concern\nundertaking or concession, or the expression of an opinion on its operations and who, in any manner, assists or shares in its financing or operation, shall be punished with imprisonment for from 6 (six) months to 2 (two) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 2 000 000 (two\nmillion) or with both such imprisonment and fine.\n2. The like assistance or sharing, except by way of shares inherited. within 5 (five) years of cessation of such duties shall be punished as provided for in Subsection 1 above.\n"}, "SECTION 136 -1": {"title": "PROHIBITED EMPLOYMENT", "content": "Any public holding administrative functions, whether temporary or not, of control, supervision, or counseling in a private company who, before the expiry of a period of 3 (three) years, with effect from the end of his functions, joins the managerial staff or enters into a contract of employment with the said company, shall be punished with imprisonment for from 6 (six) months to 2 (two) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 2 000 000 (two million) or with both such imprisonment and fine.\n"}, "SECTION137": {"title": "INDULGENCE AGAINST THE STATE", "content": "Any public servant or public employee who grants exemption from any fee, due, duty, tax or contribution, or who sells at a lesser price than that prescribed, any property of the State, of a cooperative, or of any authority or corporation either public or subject to the administrative control of the State, or in which the State holds, whether directly or not, the majority of the shares, shall be punished with imprisonment for from 2 (two) to 10 (ten) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 2 000 000 (two million).\n"}, "SECTION 138": {"title": "FAILURE TO REPORT DEFICIENCY", "content": "Any public servant or foreign public employes, having knowledge of any cash or book deficiency in the accounts of a public employee under his orders or supervision, and failing to report the deficiency to the legal authorities or to his immediate superior, shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 130 000 (one hun ired thousand) ta CFAF 1 000 000 one million).\n"}, "SECTION 139": {"title": "NEGLIGENT CUSTODY", "content": "Any custodian who by negligence permits\n- - destruction, defacement or abstraction of any property described by\nSection 187 of this Code, shall be punished with imprisonment for from 1 (one) month to 1 (one) year and with fine of from CFAF 10 000 (ten thousand) to CFAF 50 000 (fifty thousand) ;\n- - abstraction, removal or destruction within the meaning of Section 188, shall be punished with imprisonment for from 3 (three) months to 1 (one) year and with fine of from CFAF 10 000 (ten thousand) to CFAF 50 000 (fifty thousand) ;\n- - breach of seals as described by Section 191, shall be punished with imprisonment for from 6 (six) days to 6 (six) months;\n- - escape or rescue within the meaning of Section 193, shall be punished with imprisonment for from 2 (two)months to 2(two) years.\n"}, "SECTION 140": {"title": "ABUSE OF FUNCTION", "content": "1. Any public servant or foreign public employee who takes advantage of his position to infringe any private right or interest. shall be punished with imprisonment for from 1 (one) to 3 (three) years or with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand) or with both such imprisonment and fine.\n2. Where the offence is committed with the intent to procure to the offender or to another any gain of any kind, imprisonment, shall be for from 2 (two) to 10 (ten) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 141": {"title": "AGAINST CIVIC RIGHTS", "content": "Any public servant who obstructs the exercise by a citizen of his electoral rights, or his exercise or enjoyment of the rights mentioned in Section 30 (1), (2). (4) or (5) of this Code, shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n"}, "SECTION 142": {"title": "UNDUE DEMAND", "content": "Any public servant or public employee, notary public, public auctioneer, bailiff or process server or representative of any such who demands any fee due. duty or tax which is not due. or any material benefit otherwise than on payment of the proper price, shall be punished with imprisonment for from 2 (two) to 10 (ten) years and with fine of from CFAF 200 000 (two hundred thousand)to CFAF (two million).\n"}, "SECTION 143": {"title": "FAVOURITISM", "content": "1. Any public servant who decides between parties based on favour or ill will shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n2. Where that person is a judicial and legal officer or an administrative.\n"}, "SECTION 144": {"title": "FORGERY OF OFFICIAL ACT", "content": "1. Any public servant or public employee who falsely makes or alters, whether in its substance or in the dates or signatures of the parties or witnesses, any deed entry or other writing which it is his duty to draw up. record, certify or serve, shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years and with fine of from CFAF 300 000 (three hundred thousand)to CFAF 3 000 000 (three million).\n2. Whoever uses such document shall be punished as provided for in Subsection (1) above.\n"}, "SECTION 145": {"title": "FAILURE TO SUPPRESS RIOT", "content": "Any public servant who, having the power, the duty and the means so to do, refrains from dispersing a riot within the meaning of Section 232 of this Code, shall be punished with imprisonment for from 3 (three) months to 2 (two) years.\n"}, "SECTION 146": {"title": "FAILURE TO PROTECT PRIVATE RIGHTS", "content": "Any civil servant, who, having the power, the duty and the means so to do, refrains from preventing the use of force against any person, or his deprivation of liberty or any obstruction to the exercise of his civic or individual rights within the meaning of Section 141 of this Code shall be punished as an accessory.\n"}, "SECTION 147": {"title": "DENIAL OF JUSTICE", "content": "Any person exercising judiciai functions who declines, after having been\nduly moved in that behalf, to issue a decision, shall be punished with\nimprisonment for from 3 (three) months to 2 (two) years.\n"}, "SECTION 148": {"title": "REFUSAL OF SERVICE", "content": "Any public servant, notary public, public auctioneer, bailiff or process server who, having been lawfully required, refrains from performance of any duty of his office, shall be punished with imprisonment for from 3 (three) months to 2 (two) years.\n"}, "SECTION 149": {"title": "NEGLECT OF PRELIMINARIES TO MARRIAGE", "content": "1. Any registrar of births, marriages and deaths who registers a marriage celebrated by himself:\n- a) without checking that ail consents required for its validity have been given; or\n- b) before the expiry of such time as may be prescribed in case the wife has already been married,\nshall be punished with imprisonment for from 3 (three) months to 1 (one) year and with fine of from CFAF 5 000 (five thousand) to CFAF 70 000 (seventy thousand).\n1. The consequences of the irregularity in civil law shall be immaterial to the applicability of this Section.\n"}, "SECTION 150": {"title": "KEEPING OF CIVIL STATUS REGISTERS", "content": "1. Any civil status registrar who:\n- a) makes any entry elsewhere than in the registers prescribed for that purpose or fails to make such entries ;\n- b) having received a birth or death declaration fails to register it ;\n- c) celebrates a marriage for which he is not territorially competent ;\n- d) makes an entry other than those provided for ;\n- e) knowingly registers a marriage for which banns were not published or to which the impediment raised has not been lifted ;\n- f) registers a customary marriage which  has not been certified by the customary heads of the two spouses\nshall be punished with imprisonment for from 1 (one) to 3 (three) months\nand with fine of from CFAF 2 000 'two thousand) to CFAF 40 000 (forty\nthousand).\n1. Whoever, though bound by law to declare a vital event, and for no legitimate reason, fails to do so, or makes a false or inaccurate declaration,\nshall be punished as provided for in Subsection 1 above.\n"}, "SECTION 151": {"title": "PERSISTENT NEGLECT", "content": "1. Any public servant or private sector employee whose persistent neglect or obstruction is the cause of procrastination, delay or confusion, or who persistently refrains from performing any duty of his office shall be punished with imprisonment for from 3 (three) months to 2 (two) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand).\n2. Proceedings may be instituted only upon the prier complaint of his superior.\n"}}}, "CHAPTER IV": {"title": "OFFENCES AGAINST PUBLIC AUTHORITY", "sections": {"SECTION 152": {"title": "CONTEMPT", "content": "1. A contempt shall mean any defamation, abuse or threat conveyed by gesture, word or cry uttered in any place open to the public, or by any procedure intended to reach the public.\n2. The exceptions defined by Section 306 shall be applicable to contempt.\n3. Prosecution shall be barred by the lapse of four months from commission of the offence or from the last step in preparation or prosecution.\n"}, "SECTION 153": {"title": "CONTEMPT OF PRESIDENT", "content": "1. Whoever commits a contempt of the President of the Republic or any person exercising the whole or a part of their prerogatives, or of any foreign Head of State shall be punished with imprisonment for from 1 (one) to 5 (five) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 20 000 000 (twenty million) or with both such imprisonment and fine.\n2. Whoever commits a contempt of any foreign Head of Government, or of any minister in charge of foreign affaire of a foreign Government, or of a diplomatic representative accredited to the Government of the Republic shall be punished with imprisonment for from 6 (six) months to 2 (two) years or\nwith fine of from CFAF 20 000 (twenty thousand) to CFAF 20 000 000 (twenty million), or with both such imprisonment and fine.\n3. The truth of the defamatory matter may never be proved\n"}, "SECTION 154": {"title": "CONTEMPT OF PUBLIC BODIES AND PUBLIC SERVANTS", "content": "1. Whoever commits a contempt:\n- a) of any Court, of any of the armed forces, or of any public body or public administration; or\n- b) in relation to his office or position, of any Member of Government or of Parliament, or of any public servant;\nshall be punished, unless, in the case of defamation, he proves the truth of the defamatory matter, with imprisonment for 3 (three) months to 3 (three) years, or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 2 000 000 (two million), or with both such imprisonment and fine.\nWhoever, whether in speech or in writing intended for the public, incites to revolt against the Government or institutions of the Republic shall be punished with the penalties provided in subsection (1 ) above.\n"}, "SECTION 155": {"title": "WHERE NOT PUBLIC", "content": "Where any defamation, abuse or threat has been committed otherwise than publicly against any person defined by either of the last two foregoing Sections; the punishment whether of loss of liberty or of fine, shall be halved.\n"}, "SECTION 156": {"title": "ASSAULT ON PUBLIC SERVANT", "content": "1. Whoever uses force on a public servant or otherwise interferes with him, shall be punished with imprisonment for from 1 (one) month to 3 (three) years and with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand).\n2. Where the force or interference is premeditated, or where it results, intentionally or otherwise, in harm within the meaning of Sections 277 or 280 of this Code the punishment shall be imprisonment for from 5 (five) to 10 (ten) years. and fine of from CFAF 20 000 (twenty thousand- to CFAF 500 000 (five hundred thousand).\n3. The Court may in any case impose the forfeitures described by Section 30 of this Code.\n4. Where the force or interference results unintentionally in death, the\npunishment shall be imprisonment for life.\n5. Where the force or interference is intended to cause death the punishment shall be death.\n"}, "SECTION 157": {"title": "RESISTANCE", "content": "1. Whoever:\n- a) by any means whatever incites to the obstruction of the execution of any law, regulation, or lawful order of the public authority;\n- b) by force or other interference obstructs the performance of lawful, duty by any person engaged in the execution of any law, regulation, decision in the administration of justice or other lawful order shall be punished with imprisonment for from 3 (three) months to 4 (four) years.\n1. In the case provided under subsection 1 (b) above, the punishment, shall be for from 1 (one) to 5 (five) years if the offender or any co-offender is armed.\n"}, "SECTION 158": {"title": "COLLECTIVE RESISTANCE", "content": "1. Where the offence defined in the last foregoing Section is committed by 5 (five) or more persons together the punishment shall be imprisonment for from 1 (one) to (3) three years, and where at least 2 (two) of them openly bear arms the imprisonment shall be for from 5 (five) to 15 (fifteen) years.\n2. Any co-offender who himself bears arms, open or concealed, shall be punished with imprisonment for from 5 (five) to15 (fifteen) years.\n"}, "SECTION 159": {"title": "POLITICAL RESISTANCE (REPEALED)", "content": ""}, "SECTION 160": {"title": "COMPULSION OF PUBLIC SERVANT.", "content": "Whoever oy interference or threat procures a public servant improperly\nto perform or to refrain from any act of his office, shall be punished with imprisonment for from 2 (two) to 10 (ten) years and with fine of from CFAF 20 000 (twenty thousand) to 1 000 000 (one million).\n"}, "SECTION 161": {"title": "PROCURING INFLUENCE.", "content": "1. Whoever by assault or threat or by gift or promise corrupts a person having any influence, real or supposed, with interest to procure any advantage from any public authority, shall be punished in like manner as under Section 160.\n2. Any public servant or public employee who for himself or a third party solicits, receives or accepts any offer, promise or gift to procure any advantage from any public authority or body placed under the control of the public authority, any contract, operation or other benefit arising from agreements concluded with pubic authority or a body placed under the control of the public authority and in this way taking undue advantage of the real or supposed influence that his status or office has conferred upon him shall be punished in like manner as under Section 160 of this Code.\n"}, "SECTION 162": {"title": "MISLEADING PUBLIC SERVANT", "content": "1. Whoever by any false statement influences the conduct of a public servant shall be punished with imprisonment for from 15 (fifteen) days to 3 (three) months and with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand).\n2. Where the statement is a report relating to the registration of any birth, marriage or death, the imprisonment shall be from 3 (three) months to 3 (three) years.\n3. Where the statement is made on oath the imprisonment shall be from 1 (one) to 5 (five) years.\n4. Whoever by any means procures the entry in the criminal record of any one person of the conviction of any other shall be punished with imprisonment for from 1 (one) to (5) five years.\n5. Whoever by any means procures the improper issue to himself of an extract from the criminal record of another person shall be punished with imprisonment for from 1 (one) month to 1 <one) year.\n"}, "SECTION 163": {"title": "FRAUD AT EXAMINATIONS", "content": "Whoever commits any fraud at an examination or competition with intent thereby to procure his entry into any public service, or any degree certificate or qualification issued by the State or by a public service, whether national or foreign shall be punished with imprisonment for from 1 (one) month to 3 (three) years or with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 2 000 000 (two million), or with both such imprisonment and fine.\n"}, "SECTION.163 -1": {"title": "CORRUPTION IN ADMINISTRATIVE COMPETITIVE EXAMINATIONS OR OTHER EXAMINATIONS", "content": "1. Whoever, through corruption facilitates the success or causes the failure of a candidate in an administrative competitive examination or other examinations shall be punished with imprisonment for from 2 (two) to 5 (five) years or with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million) or with both such imprisonment and fine.\n2. Whoever through corruption declares successful one or more candidates who did not sit for an examination shall be punished as provided for in Subsection 1 above.\n"}, "SECTION 164": {"title": "PERJURY", "content": "1. Whoever in any proceeding gives on oath or affirmation false evidence capable of influencing the decision, shall be punished, where he may no longer alter it:\n- a) Where the proceeding terminates in an order of discharge, with imprisonment for from 3 (three) months to 1 (one) year and with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand) ;\n- b) Where the proceeding is a criminal trial and the charge is:\n- - simple offence, with imprisonment for from 6 (six) months to 3 (three) years and with fine of from CFAF 5 000 (five thousand)  to CFAF  100 000 (one hundred thousand);\n- - of misdemeanour. with imprisonment for from one to 5 (five) years and with fine of from CFAF 0 000 ‘ten thousand) to CFAF 500 000 five hundred thousand);\n- - of felony. with imprisonment for from 5 (five to 10 (ten) years and with fine of from CFAF 50 000 (fifty thousand' to CFAF 2 000 000 (two million);\n- - of felony punishable with death, with imprisonment for life.\n- c) In the case of any other proceeding with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand).\n1. Where the false witness has received any gift or accepted any promise, any penalty of limited duration and any fine shall be doubled, and any such gift shall be confiscated.\n2. Any interpreter who in any proceeding distorts the meaning of any words or writing which he is bound to translate shall be punished in like manner as if he had committed perjury.\n"}, "SECTION 165": {"title": "FALSE EXPERT REPOR", "content": "An expert referee making a false report which he may no longer alter shall be punished as provided by Section 164 (2).\n"}, "SECTION 166": {"title": "FALSE OATH", "content": "Any party to judicial proceedings other than criminal who swears falsely to any point the truth of which has been committed to his oath shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 167": {"title": "CONCEALMENT OF PROCEEDING", "content": "Any party to judicial proceedings who keeps his opponent, by any false pretence within the meaning of Section 318 (1) (c), in ignorance of any step against him shall be punished with imprisonment for from 3 (three) months to 2 (two) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million) or with both such imprisonment and fine.\n"}, "SECTION 168": {"title": "CONCEALMENT AND FABRICATION OF EVIDENCE", "content": "1. Whoever with intent to influence any judicial proceeding:\n- - destroys or conceals any physical evidence or obstructs the\nattendance of a witness. or\n- - fabricates or uses false physical evidence or misleads a witness;\nshall be punished in like manner as if he had committed perjury, according to\nthe distinctions drawn by Section 164.\n1. Whoever obtains from any person a promise not to report a felony or misdemeanour, or not to give evidence, shall be punished in like manner.\nProvided that this subsection shall not apply to a promise obtained without the aid of the means described by Section 161 from the victim of a misdemeanour or his legal representative.\n"}, "SECTION 169": {"title": "PREJUDICIAL COMMENT", "content": "1. Whoever refers publicly to any judicial proceeding not yet terminated by final judgment in a manner liable to influence, whether intentionally or not, the opinion of any person for or against any party, shall be punished with imprisonment for from 15 (fifteen) days to 3 (three) months and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n2. Nothing in this Section shall apply to an account in good faith of proceedings in open Court.\n3. Where the offence is committed through the print media, radio or television, the imprisonment shall be from three months to two years and the fine from one hundred thousand to five million francs.\n"}, "SECTION 170": {"title": "FORFEITURES", "content": "Upon conviction under any of the last five foregoing Sections the Court may impose the forfeitures described by Section 30 of this Code.\n"}, "SECTION 171": {"title": "NON-INTERVENTION", "content": "Whoever being able so to do by his own immediate action and without risk to himself or to any other person, refrains from preventing the commission of any felony or of a misdemeanour against the bodily integrity of any person, shall be punished with imprisonment for from 1 (one) month to 3(three Ï years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million ) or with both such imprisonment and fine.\n"}, "SECTION 172": {"title": "REFUSAL TO CLEAR", "content": "Whoever, being able so to do without incriminating himself his spouse, or any ascendant or descendant, refrains from communicating, to the judicial\nor police authorities. evidence of the innocence of any person in custody awaiting trial for felony or misdemeanour, or. notwithstanding that the\njudgment may not be final, convicted of felony or misdemeanour, shall be punished with imprisonment for from 1 (one) month to 3 (three) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million) or with both such imprisonment and fine.\n"}, "SECTION 173": {"title": "DEFAULTING WITNESS", "content": "1. Any person regularly summoned as a witness in any proceeding who without just cause fails to appear or declines to take oath or to affirm, or to give evidence, shall be punished with imprisonment for from 6 (six) days to 3 (three) months and with fine of from CFAF 1 000 (one thousand) to CFAF 50 000 (fifty thousand).\n2. Whoever, having publicly referred to a felony or misdemeanour and publicly proclaimed his knowledge of the offender or of his accessories, refuses to answer or evades the questions on such point of the judicial or legal officer having jurisdiction, shall be punished with imprisonment for from 6 (six) days to 1 (one) year or with fine of from CFAF 20 000 (twenty thousand) to CFAF 400 000 (four hundred thousand). or with both such imprisonment and fine.\n"}, "SECTION 174": {"title": "DEFAULTING EXPERT", "content": "Any person whose assistance has been regularly required as expert, medical practitioner or interpreter by any judicial or legal authority and who without just cause declines to furnish it shall be punished with fine of from CFAF 20 000 (twenty thousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 175": {"title": "DEFAULTING JUROR OR ASSESSOR", "content": "Any person summoned as juror or assessor who without just cause fails to appear or to take oath or to affirm as required by law or withdraws before the termination of his duties, shall be punished with imprisonment for 6 (six) days to 3 (three) months and with fine of from CFAF5 000 (five thousand) to CFAF 50 000 (fifty thousand).\n"}, "SECTION 176": {"title": "FALSE EXCUSE", "content": "Whoever falsely excuses himself under any of the last three foregoing Sections, shall be punished with imprisonment for from 1 (one) to 3 (three?\nmonths\n"}, "SECTION 177": {"title": "BANNED RESIDENCE", "content": "Whoever appears in any place from which he has been banned. or removes from any place to which he has been restricted, under Section 42 of this Code, shall be punished with imprisonment for from 1 (one) month to 1 (one) year.\n"}, "SECTION 178": {"title": "OTHER PENALTIES AND MEASURES", "content": "Whoever:\n- a) follows an occupation which has been forbidden him under Section 36 of this Code; or\n- b) reopens any premises closed under Section 34 of this Code; or\n- c) infringes any forfeiture or obligation not covered by the last foregoing Section which has been imposed upon him under Sections 31, 41 or 42\nshall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n"}, "SECTION 179": {"title": "CUSTODY OF MINOR", "content": "1. Whoever fails to return a minor to the person to whom his custody has been granted by order, whether permanent or temporary, of a Court, shall be punished with imprisonment for from one 1 (one)month to (1) one year and with fine of from CFAF 5 000 (five thousand) to CFAF 1 000 000 (one million).\n2. Where the offender has been deprived of parental power, the imprisonment may extend to 3 (three) years.\n"}, "SECTION 180": {"title": "MAINTENANCE", "content": "1. Whoever lets pass two months without paying in full any maintenance which he has been ordered by a Court to pay to his spouse ascendant or descendant shall be punished with imprisonment for from 1 (one) month to 1 (one) year or with fine of from CFAF 20 000 (twenty thousand) to CFAF 400 000 (four hundred thousand) or with both such imprisonment and fine.\n2. Any such default shall be presumed to have been intentional, save otherwise proven. However, any inability to pay arising from drunkenness or other habitual misconduct shall under no circumstances serve as a defence for the debtor.\n"}, "SECTION 180-1": {"title": "SURVIVOR’S PENSION", "content": "Whoever deprives a surviving spouse or orphans from benefitting from the survivor’s pension to which they are entitled shall be punished as provided for in Section 180 (1) above.\n"}, "SECTION 181": {"title": "WILLFUL INSOLVENCY", "content": "Whoever after the decision of any Court, final or otherwise, ordering payment of a sum of money, contrives to be insolvent shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n"}, "SECTION 181 -1": {"title": "REFUSAL TO ENFORCE A COURT JUDGMENT THAT HAS BECOME FINAL", "content": "1. Whoever refuses to enforce a court judgment that has become final shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n2. Whoever obstructs the enforcement of a court judgment that has become final without referring to the judge in charge of enforcing court judgments shall be punished as provided for in Subsection (1 ) above.\nWhere the offender is a public servant as defined by Section 131 of this Code, criminal prosecution shall not bar disciplinary proceedings.\n1. Where the offender is a corporate body, as defined in Section 74-1 of this Code, the penalty shall be a fine of from CFAF 200 000 (two hundred thousand) to CFAF 10 000 000 (ten million).\n"}, "SECTION 182": {"title": "RE-ENTRY ON IMMOVEABLE PROPERTY", "content": "Whoever within 3 (three; months of execution of or submission to an order against him for possession of any immoveable property retakes possession from the party to whom it has been awarded by the Court shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months.\n"}, "SECTION 183": {"title": "REFUSAL OF TAX", "content": "1. Whoever by any means organizes a collective refusal to pay any tax shall be punished with imprisonment for from 3 (three) months to 2 (two) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million).\n2. Whoever instigates the public to refuse or to delay the payment of any tax shall be punished with imprisonment for from 6 (six) months to 1 (one) year and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 184": {"title": "MISAPPROPRIATION OF PUBLIC PROPERTY", "content": "1. Whoever, by whatever means, fraudulently takes or keeps any property, movables or immovables belonging to, destined or entrusted to the State, cooperative, council or public establishment under the supervision of the State or in which the State directly or indirectly holds the majority of the shares shall be punished:\n- a) where the value of the property exceeds CFAF 500 000 (five hundred thousand) francs with imprisonment for life;\n- b) where the value of the property is above CFAF 100 000 (one hundred thousand) but below or equal to CFAF 500 000 (five hundred) thousand, with imprisonment of from 15 (fifteen) to 20 (twenty) years;\n- c) where the value of the property is less than or equal to CFAF 100 000 (one hundred thousand) with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 50 000 (fifty) to CFAF 500 000 (five hundred thousand).\n1. The penalties provided in subsection 1 above may not be reduced by mitigating circumstances respectively below 10 (ten), 5 (five) or 2 (two) years and a suspended sentence may not be granted.\n2. Where Section 87(2) of this Code is applicable the minimum punishment may be 5 five) years, 2 (two) years and .one) year and execution may not be suspended except in case of diminished responsibility of infancy.\n3. Confiscation under Section 35 of this Code shall be ordered in every\ncase and the forfeitures described in Section 30 shall be imposed for from 5 (five) to 10 (ten) years.\n4. Publication of the judgment shall be ordered.\n5. This Section shall not apply to misappropriation and receiving of military property covered by the military justice codes.\n"}, "SECTION 185": {"title": "DISTURBANCE", "content": "Whoever disturbs the operation of any public service to which he does not belong shall be punished with imprisonment for from 6 (six) days to 1 (one) month or with fine of from CFAF 1 000 (one thousand) to CFAF 50 000 (fifty thousand).\n"}, "SECTION 187": {"title": "DAMAGE TO PUBLIC OR PROTECTED PROPERTY", "content": "Whoever destroys or defaces any monument, statue or other property dedicated to public use or adornment and erected by public authority or by leave of the said authority, or any protected immovable or movable object or natural feature or site, shall be punished with imprisonment for from 1 (one) month to 2 (two) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 120 000 (one hundred and twenty thousand).\n"}, "SECTION 187-1": {"title": "OFFENCES RELATING TO NATIONAL CULTURAL AND NATURAL HERITAGE", "content": "1. Whoever:\n- - unlawfully exploits or exports the natural and cultural property of the State and carries out any other activity that devalues it;\n- - refuses to include in the inventory or to record movables and immovables belonging to the State, regional and local authorities or to any natural person or corporate body and, that from a historical artistic philosophical scientific technical or touristic perspective has value that makes it worthy of preservation ,\n- - refuses to classify or declassifies a cultural and natural property belonging to the State;\n- - disposes of the classified property either gratuitously or for profit:\n- - posts notices or installs advertisement equipment on classified monument;\n- - exports any classified or to-be classified property, save with a special temporary exportation authorization issued by the competent authority,\nshall be punished with imprisonment for from 6 (six) months to 2 (two) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 3 000 000 (three million).\n1. Whoever, without the authorization of the competent authority;\n- - destroys, depreciates. transforms or excavates, disposes of or pollutes any cultural property;\n- - displaces or transfers ownership of a to-be classified property and carries out any work other than routine maintenance or ordinary exploitation;\n- - destroys or carries out restoration or conversion works on classified property:\n- - erects buildings or creates easements on classified property;\n- - carries out archaeological excavations and explorations of classified or to-be classified sites;\n- - exports non-classified property, in particular, antique,\n shall be punished with the penalties provided for in Subsection 1 above \n"}, "SECTION 188": {"title": "- REMOVAL AND DESTRUCTION OF PUBLIC RECORDS", "content": "1. Whoever abstracts, removes or destroys any document in the custody of any public authority shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 200 000 (two hundred thousand).\n2. (2) Whoever destroys or damages any register, record or other original document of any public authority shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 25 000 (twenty-five thousand) to CF AF 200 000 (two hundred thousand’\n"}, "SECTION 188-1": {"title": "REMOVAL AND MISAPPROPRIATION OF PUBLIC OR PRIVATE RECORDS", "content": "Whoever removes or misappropriates public or private records to whichhne has access by virtue of his duties shall be punished as provided for in Subsection 188 (2)above.\n"}, "SECTION 188-2": {"title": "UNLAWFUL DESTRUCTION, TRANSFER AND EXPORTATION OF PUBLIC OR PRIVATE RECORDS", "content": "Whoever unlawfully destroys, transfers or exports public or private records shall be punished as provided for in Subsection 188 (2) above.\n"}, "SECTION 189": {"title": "- COPIES OF GOVERNMENT PAPERS", "content": "Whoever takes, without authority or permission, a copy of any document the property of the Government shall be punished with imprisonment for from 1 (one) month to 1 (one)year.\n"}, "SECTION 190": {"title": "MISAPPROPRIATION OF ATTACHED PROPERTY", "content": "Whoever misappropriates, destroys or damages any attached or garnished property shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 191": {"title": "BREACH OF SEALS", "content": "Whoever breaks any seal lawfully affixed shall be punished with imprisonment for from 6 (six) months to (2) two years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 192": {"title": "COMMUNICATION WITH PERSONS IN CUSTODY", "content": "Whoever contrary to the rules governing the custody of any person lawfully detained facilitates his relations with any outside party, shall be punished with imprisonment for from 6 (six) months to 2 (two) years.\n"}, "SECTION 193": {"title": "ESCAPE", "content": "1. Whoever escapes from lawful custody or who being permitted to\nwork out of the prison leaves his place of work without permission shall be punished with imprisonment for from 1 (one) year to 3 (three) years\n2. Whoever rescues any person from lawful custody shall be punished\nin like manner.\n3. For escape or rescue effected by force to the person or to property the punishment shall be imprisonment for from 1 (one) to 5 (five) years; and for escape or rescue with arms the punishment shall be imprisonment for from 5 (five) to 10 (ten) years.\n4. Where the person in custody is charged with felony or has been sentenced to loss of liberty for more than 10 (ten) years the punishment shall be imprisonment for from 5 (five) to 10 (ten) years.\n"}, "SECTION 194": {"title": "ACCESSORY AFTER THE FACT BY SHELTER", "content": "1. An accessory after the fact to felony or misdemeanour by shelter of the offender, whether convicted or not, shall be punished with imprisonment for from 2 (two) months to 2 (two) years.\n2. Where the principal offence is punishable with death, the accessory shall be punished with imprisonment for from 2 (two) to 10 (ten) years.\n3. No defence absolving from responsibility a principal not yet acquitted shall be available to the accessory.\n"}, "SECTION 195": {"title": "SUBSCRIPTION FOR FINE", "content": "Whoever publicly invites subscriptions for the purpose of indemnifying any person against any pecuniary sentence passed on him by a criminal court shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months or with fine of from CFAF 20 000 (twenty thousand) to CFAF 10 000 000 (ten million), or with both such imprisonment and fine.\n"}, "SECTION 196": {"title": "DEFACEMENT OF POSTERS", "content": "Whoever removes, obliterates or defaces any notice posted under Section 33 of this Code shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months or with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand^ or with both such imprisonment and fine\n"}, "SECTION 197": {"title": "REVENGE ON WITNESS", "content": "Whoever: \n- a) commits a contempt of a witness by reason of the evidence which he has given, unless, in the case of defamation, he proves the truth of the\ndefamatory matter; or\n- b) causes any loss to a witness by reason of the evidence which he has given, shall be punished with imprisonment for from 10 (ten) days to (1) one year, or with fine of from 10 000 (ten thousand) to CFAF 200 000 (two hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 198": {"title": "FORBIDDEN PUBLICATIONS", "content": "1. Whoever publishes:\n- - any record of any proceeding of a Court or of the Legal Department in respect of felony or misdemeanour before it has been read out in open Court; or\n- - any account of proceedings in camera or in any juvenile court; or\n- - any conviction of a minor mentioning any particular allowing of his identification; or\n- - any information on the proceedings of parliamentary inquiry committees before their report has been laid on the table of the House, except a communique issued by the bureau of the said committees; or:\n- - any information on the proceedings of the Higher Judicial Council except a communique issued by the Chairman or Vice-Chairman of the Council,\nshall be punished with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand).\n1. Whoever publishes any deliberation in chambers by any Court shall be punished with fine of from CFAF 10 000 (ten thousand) to CFAF 3 000 000 (three million).\n2. In case of publication by the press the penalties shall be doubled.\n3. Whoever in a Courtroom or during Court proceedings without the authorization of the presiding judge\n- a) makes any Sound recording; or\n- b) shoots any image shall be punished as provided for in Subsection 2\nabove\n"}, "SECTION 199": {"title": "INNKEEPER’S REGISTER", "content": "Any keeper of an inn or common boarding house, who, contrary to any regulation, does not register, or registers under a false name, any person staying in the said inn or boarding house shall be punished with imprisonment for from 6 (six) days to 3 (three months), and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n"}, "SECTION 200": {"title": "LLLICIT BURIAL", "content": "Whoever disposes of a human corpse otherwise than as prescribed by law or regulation shall be punished with imprisonment for from 6 (six) days to 3 (three) months and with fine of from CFAF 2 000 (two thousand) to CFAF 15 000 (fifteen thousand).\n"}}}, "CHAPTER V": {"title": "OFFENCES AGAINST STATE GUARANTEES", "sections": {"SECTION 201": {"title": "GREAT SEAL", "content": "1. Whoever forges the Great Seal or makes use of such forged Seal shall be punished with imprisonment for life.\n2. Whoever makes use of the Great Seal improperly procured shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years,\n3. Whoever acts in contravention of the regulations in force on ordering, manufacturing, and affixing of the Great Seal, shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 40 000 (forty thousand) to CFAF 4 000 000 (four million).\n4. In case of conviction, the Court shall also order the forfeitures provided for in Section 30 of this Code for a period of from 5 (five) to 10 (ten) years.\n"}, "SECTION 201-1": {"title": "OTHER PUBLIC SEALS", "content": "1. Whoever contravenes the regulations on ordering, manufacturing keeping and affixing of other public seals shall be punished with imprisonment for from 1 (one) to 5 (five) years and fine of from CFAF 40 000 (forty thousand) to CFAF 4 000 000 (four million).\n2. In case of conviction, the Court may order the forfeitures provided for in Section 30 of this Code for a period of from 1 (one) to 5 (five) years.\n"}, "SECTION 202": {"title": "TREASURY SECURITY", "content": "Whoever forges or alters any security issued by the public treasury under its stamp or mark or makes use of any such forged or altered security, shall be punished with imprisonment for life.\n"}, "SECTION 203": {"title": "SIGNATURE, STAMPS AND PUNCHES", "content": "1. Whoever forges or alters the signature of the President of the Republic, of either Prime Minister or of any minister. deputy minister or secretary of state, or any Government stamp or any punch for hall-marking or silver, shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\n2. Whoever makes use of any such forged stamp or punch, or of any document or object bearing such forged or altered signature, stamp or mark shall be punished in like manner.\n3. Whoever makes use of any such stamp or punch, or of any document or object bearing such signature, stamp or mark where genuine but improperly procured, shall be punished in like manner.\n"}, "SECTION 204": {"title": "MARKS AND STATIONERY", "content": "1. Whoever forges or alters:\n- a) any seal, stamp or mark of a legislative assembly or of a Court or of an administrative office; or\n- b) the printed stationery or forms of any legislative assembly, Court or administrative office; or\n- c) any punch or mark designed to be placed in the name of the government on weights or measures, or on merchandise; or\n- d) any hammer used for punching government forestry marks; or\n- e) any postage stamp, postmark or reply coupon issued by the postal administration or any revenue stamp or impressed stamp.\nshall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 40 000 (forty thousand) to CFA F 4 000 000 (four million).\n1. Whoever distributes, sells or makes use of such forged or altered\nseal, stamp punch, mark, post-mark, paper or coupon, shall be punished in\nlike manner.\n2. Whoever distributes, sells or makes use of any such thing where genuine but improperly obtained, shall be punished in like manner.\n"}, "SECTION 205": {"title": "PUBLIC ACT, DOCUMENT OR RECORD", "content": "1. Whoever forges or alters, whether in its substance or in its date, signatures or countersignatures, any act of the legislature, of the executive (including a passport) or of the judiciary. or any document or record drawn up by a person having exclusive authority so to do, shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\n2. Whoever makes use of any such document or record so forged or altered shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 40 00 (forty thousand) to CFAF 2 000 000 (two million).\n"}, "SECTION 206": {"title": "LICENCES AND SIMILAR DOCUMENTS", "content": "Whoever :\n- - forges or alters an identity card, driving licence, game licence, elector's card, family booklet or military booklet: or\n- - procures the issue for himself or for another of any such document under a wrong name; or\n- - makes use of any such document, whether forged, altered or issued in a wrong name; or\n- - makes dishonest use of any genuine document of such nature belonging to another,\nshall be punished with imprisonment for from 3 (three) months to 3 (three) years.\n"}, "SECTION 207": {"title": "OFFICIAL CERTIFICATES", "content": "1. Whoever forges or alters any official certificate shall be punished with imprisonment for from 6 (six) months to 3 (three) years.\n2. Whoever makes use of any such certificate shall be punished in like manner.\n"}, "SECTION 208": {"title": "POSTAGE AND REVENUE STAMPS", "content": "Whoever makes use of any postage or revenue stamp already used, or surcharges any postage or revenue stamp, or makes unauthorized use of any postal privilege, shall be punished with imprisonment for from 10 (ten) days to 1 (one) year. and with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand).\n"}, "SECTION 209": {"title": "POSTAL DOCUMENTS", "content": "1. Whoever forges or alters\n- a) any postal identity card, whether national or foreign, or any subscription card in respect of poste restante; or\n- b) any label, stamp, postmark or reply-coupon issued by a foreign postal administration,\nshall be punished with imprisonment for from 10 (ten) days to 6 (six) months and with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand). \n1. Whoever sells, offers for sale or makes use of any such matter shall be punished in like manner.\n"}, "SECTION 210": {"title": "COLOURABLE RESEMBLANCE", "content": "Whoever manufactures, sells, distributes or makes use of any object or printed matter bearing to any object or printed matter described in Sections 201 to 209 above, a resemblance liable to facilitate their acceptance in place of the object or matter imitated, or to mislead the public, shall be punished with imprisonment for from 10 (ten) days to 6 (six) months, and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand).\n"}, "SECTION 211": {"title": "COUNTERFEIT NOTE AND COIN", "content": "1. Whoever:\n- a) counterfeits or alters any currency note or any gold or silver coin being legal tender in the Republic; or\n- b) imports into the Republic any such counterfeit or altered note or coin; or\n- c) utters any such counterfeit note or coin shall be punished with imprisonment for life.\n1. In the case of any other currency note or coin national or foreign, and whether or not legal tender, the punishment shall be imprisonment for from 10 (ten) to 20 (twenty) years.\n2. Where the alteration consists in the mere colouring of coin, whether or not legal tender in the Republic or abroad, the punishment shall be imprisonment for from 6 (six) months to 5 (five) years.\n3. Where the coin or note has been received in ignorance of the tact that it was counterfeit or altered, and uttered after knowledge of the same, the punishment shall be imprisonment for from 3 (three) months to 3 (three) years and fine of 3 (three) times the face value of the said coin or note.\n"}, "SECTION 212": {"title": "COUNTERFEITING EQUIPMENT", "content": "Whoever without authority manufactures or possesses any instrument, apparatus, machine or material designed for the forgery of the Great Seal, any treasury security, or any punch, stamp or mark, or for the counterfeiting of note or coin, whether national or foreign, shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 213": {"title": "IMPROPER POSSESSION", "content": "Whoever without authority possesses anything or document described in section 201 to 211 inclusive of this Code shall be punished with imprisonment for from 1 (one) to 5 (five) years.\n"}, "SECTION 214": {"title": "ACCESSORY PENALTIES", "content": "1. On conviction for any misdemeanour defined in the foregoing thirteen sections the Court may impose the forfeitures described in section 30 of this Code\n2. On any conviction under the said sections confiscation under section\n35 shall be ordered\n"}, "SECTION 215": {"title": "STRIKING MONEY", "content": "Whoever without authority:\n- a) strikes coin of whatever form or denomination, or prints any note payable to bearer, or imports, or utters such coin or note; or\n- b) manufactures or possesses any machine, apparatus, instrument or material capable of use for the striking or printing of any note or coin liable to be mistaken for lawful money ,\nshall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 150 000 (one hundred and fifty thousand).\n"}, "SECTION 216": {"title": "USURPATION OF OFFICE", "content": "1. Whoever assumes any public office, whether civil or military, to which he is not appointed, or performs any act belonging to any such office, shall be punished with imprisonment for from 6 (six) months to 5 (five) years.\n2. In the case of a public servant continuing to act in an office after official notice of his cessation from the said office, whether temporary or final, the punishment shall be imprisonment for from 3 (three) months to 2 (two) years.\n3. On conviction the Court may also impose the forfeitures described by section 30 of this Code,\n4. Where the offender takes advantage of his usurpation to commit any offence defined by Chapter III of this Part, he shall be punished as if he held the office usurped,\n"}, "SECTION 217": {"title": "IRREGULAR SOLEMNISATION OF MARRIAGE", "content": "Any minister of religion who:\n- a) not being authorised to perform a civil marriage, solemnises a religious ceremony of marriage without having seen a certificate of marriage already performed by a registrar of births, marriages and deaths; or\n- b) being authorised to perform a civil marriage,\n- - solemnises only a religious ceremony of marriage; or\n- - performs a civil marriage without having seen a certificate of no impediment from the said registrar , shall be punished with fine of from CFAF 5 000 (five thousand) to CFAF 30 000 (thirty thousand), and on subsequent conviction within the meaning of section 88 of this Code, with imprisonment for from 1 (one) to 5 (five) years.\nSECTION 218; Usurpation of Uniform or Decoration\nWhoever wears in public any uniform or decoration to which he is not entitled, or which bears a colourable resemblance to the same, shall be punished with imprisonment for from 3 (three) months to 2 (two) years or with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand) or with both such imprisonment and fine.\n"}, "SECTION 219": {"title": "USURPATION OF QUALIFICATION", "content": "Whoever without being entitled thereto makes use of a qualification belonging to a profession legally regulated, or of an official degree, certificate of education or diploma, or of a title governed by public regulation, shall be punished with imprisonment for from 3 (three) months to 2 (two) years or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 2 000 000 (two million), or with both such imprisonment and fine.\n"}, "SECTION 219 -1": {"title": "USURPATION OF DESIGNATION", "content": "Whoever, unauthorized by the laws and regulations applicable, uses the designations cooperative society, union of cooperative societies, federation of cooperative societies, or confederation of cooperative societies alongside any qualifier, as well as any other designation referring to any of the groups mentioned in this Section, shall be punished with imprisonment for from 1 (one) month to 1 (one) year or with fine of from CFAF100 000 (one hundred thousand) to CFAF 1 000 000 (one million) or with both such imprisonment\nand fine,\n"}, "SECTION 220": {"title": "TITLE OF HONOUR", "content": "Whoever makes public use of any title of honour to which he is not entitled shall be punished with fine of from CF AF 5 000 (five thousand) to CFAF 2 000 000 (two million)\n"}, "SECTION 221": {"title": "COMMON PROVISIONS", "content": "1. The three last foregoing sections shall be equally applicable to any foreign uniform, decoration, title or qualification.\n2. The said sections shall not apply to the actors at a public entertainment nor to children's games.\n3. On conviction under any one of the said sections the Court shall order the marginal annotation of the said judgment on any notarial deed or register of births, marriages and deaths in which the title has been assumed, and may also order publication of its judgment.\n"}, "SECTION 222": {"title": "CREDIT OF THE STATE", "content": "1. Whoever by any means, with intent to injure the credit of the State:\n- a) spreads publicly any false or misleading rumour likely to undermine confidence in the stability of the currency or in the value of any public funds or of the funds of any cooperative, or of any authority or corporation either public or subject to the administrative control of the State, or in which the State holds directly or indirectly the majority of the shares; or\n- b) encourages the public to withdraw funds from any public deposit or from any establishment compelled by law to pay into a public deposit, or to sell any Government loan or other treasury paper, or discourages the public from purchase of or subscription to the same;\nshall be punished with imprisonment for from 3 (three) months to 2 (two) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million).\n1. On conviction under this section the Court shall order publication of the judgment.\n"}, "SECTION 223": {"title": "LEGAL TENDER", "content": "Whoever refuses any note or coin being legal tender in the Republic and to the extent that it is legal tender, shall be punished with imprisonment for from 10 (ten) days to 3 (three) months, or with fine of from CFAF 1 000 (one thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine\n"}, "SECTION 224": {"title": "NATIONAL DEVELOPMENT", "content": "Whoever with intent to injure the national development transfers abroad any specialized staff or delivers abroad any industrial or commercial secret, shall be punished with imprisonment for from 6 (six) months to 2 (two) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 5 000 000 (five million).\n"}, "SECTION 225": {"title": "LOANS AND SUBSIDIES", "content": "Whoever puts to any use other than that for which it was granted a loan or subsidy from the Federal or Federated State, from a co-operative, or from an authority or corporation described by Section 184 of this Code, shall be punished with imprisonment for from 1 (one) to 10 (ten) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 226": {"title": "STANDARD REGULATIONS", "content": "Whoever infringes any regulation prescribing standards for any produce to be exported, shall be punished with fine of from CFAF 50 000 (fifty thousand) to CFAF 4 000 000 (four million), and with confiscation of the goods in question.\n"}}}}}, "PART II": {"title": "FELONIES AND MISDEMEANOURS AGAINST THE GENERAL INTEREST", "chapters": {"CHAPTER I": {"title": "PUBLIC SAFETY", "sections": {"SECTION 227": {"title": "ARSON AND DESTRUCTION", "content": "1. Whoever sets fire, directly or indirectly, and notwithstanding that he may be the owner:\n- a) to any place used for another’s dwelling ; or\n- b) to any land, sea or air vehicle in which are one or more persons ; or\n- c) to any working mine or its appurtenances\nshall be punished with imprisonment for from 3 (three; to 10 (ten) years and with fine of from CFAF 5 000 (five thousand) to CFAF 1 000 000 (one million).\n1. Destruction of such property shall be punished in like manner as arson.\n"}, "SECTION 228": {"title": "DANGEROUS ACTIVITIES", "content": "1. Whoever fails properly to provide against risk of bodily harm to any person from his dangerous activities shall be punished with imprisonment for from 6 (six) days to 6 (six) months.\n2. Whoever rashly and in manner liable to cause harm to any person:\n- a) makes use of fire, or of any inflammable or explosive matter, or of electricity, or of any machinery or,\n- b) demolishes in whole or in part any construction or any uninhabited building, notwithstanding that he may be the owner; or\n- c) furnishes medical or surgical treatment, or furnishes or administers any drug or other substance or,\n- d) leads, drives, rides, stops or leaves any animal or vehicle on the public highway, shall be punished with imprisonment for from 3 (three) months to 3 (three) years, or with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand), or with both such imprisonment and fine.\n1. Whoever drives any vehicle when drunk or under the influence of drugs shall be punished in like manner.\n2. Upon conviction under subsection (2) (d) in respect of a vehicle, or under subsection (3), the Court may add disqualification from holding a driving licence for up to 2 (two) years.\n"}, "SECTION 229": {"title": "EXPLOSIVE SUBSTANCES", "content": "Whoever infringes any regulation governing the manufacture, storage, transport, import or export of, or trade in explosive substances, shall be punished with imprisonment for from 1 (one) month to 1 (one) year, or with fine of from CFAF 2 000 (two thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 229-1": {"title": "TOXIC WASTE", "content": "1. Whoever, unauthorized does not, with immediate effect discard of dangerous or toxic waste generated by its company shall be punished with imprisonment of from 5 (five) to 10 (ten) years and a fine of from CFAF 5 000 000 (five million) to CFAF 500 000 000 (five hundred million)\n2. The provisions of Sections 54 and 90 of this Code relating to suspended sentence and mitigation shall not apply.\n3. The court seized shall order the person found guilty of introducing, producing, storing, holding, transporting, causing to transit, or releasing dangerous or toxic waste to dispose of it with immediate effect and restore the site.ln addition, the court may order the closure of the company.\n"}, "SECTION 230": {"title": "PUBLIC HIGHWAY", "content": "1. Whoever without lawful permission obstructs the use of any public- highway or waterway, or renders passage less convenient, whether by damaging the surface of the highway or diverting the course of the waterway, or by any erection, or by excessive use, or by use of his own adjacent land, shall be punished with imprisonment for from 1 (one) month to 2 (two) years.\n2. Whoever, being bound to repair any highway or any work connected with it, refrains from so doing, shall be punished in like manner.\n"}}}, "CHAPTER II": {"title": "OFFENCES AGAINST PUBLIC PEACE", "sections": {"SECTION 231": {"title": "UNLAWFUL PUBLIC MEETINGS AND PROCESSIONS", "content": "1. Whoever: \n- a) takes part in the organization of any public meeting which has not been the subject of a prior declaration ;\n- b) makes a declaration that is intended to mislead authorities on the conditions and purpose of the meeting ;\n- c) convenes a procession in any manner whatsoever before filling the declaration or after it has been legally prohibited ;\n- d) makes an incomplete or false declaration in order to conceal the conditions of the planned procession ; shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months and with fine of from CFAF 5 00C 'five thousand) to CFAF 100 000 (one hundred thousand)\n1. Whoever organizes any public procession without the required declaration or after the notification of legal prohibition shall be punished with the penalties provided for in Subsection 1 above\n"}, "SECTION 231 -1": {"title": "POLITICAL PROCESSION IN A PUBLIC ESTABLISHMENT AND IN SCHOOLS", "content": "Whoever organizes a political procession in any public establishment, school or university shall be punished with imprisonment for from 10 (ten) days to 4 (four) months or with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 250 000 (two hundred and fifty thousand) or with both such imprisonment and fine.\n"}, "SECTION 232": {"title": "RIOT", "content": "1. A riot shall mean an assembly on the public highway of 5 (five) or more persons in manner liable to disturb the public peace.\n2. Whoever takes part in a riot and does not withdraw the first call of the proper authority shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months.\n3. The penalty shall be doubled for any person who continues in the riot until it be dispersed by force.\n"}, "SECTION 233": {"title": "ARMED RIOT", "content": "1. Whoever takes part in a riot which is armed within the meaning of sections 115 (3) and 117 of this Code, and himself bears any weapon or does not withdraw on the first call of the proper authority, shall be punished with imprisonment for from 3 (three) months to 2 (two) years.\n2. The punishment shall be imprisonment for from 2 (two) to 5 (five) years for any person who continues in the riot until it be dispersed by force.\n3. The punishment shall be imprisonment for from 5 (five) to 10 (ten) years for any person who takes part in the riot at the moment when any such weapon is used.\n4. All punishment under this section shall be doubled where the riot takes place at night.\n"}, "SECTION 234": {"title": "FORFEITURES", "content": "Upon conviction under section 233 above the Court may add the forfeitures described by section 30 of this Code\n"}, "SECTION 235": {"title": "SEDITIONS CRIES", "content": "Whoever in any place open to the public utters any seditious cry or song shall be punished with imprisonment for from 8 (eight) days to 1 (one) month, or with fine of from CFAF 2 000 (two thousand) to CFAF 50 000 (fifty thousand), or with both such imprisonment and fine.\n"}, "SECTION 236": {"title": "DEPREDATION BY BAND", "content": "1. Whoever as a member of an assembly or band, and by open force, plunders or damages any moveable or immoveable property, shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\n2. For such felony committed in a State of emergency or siege the punishment shall be imprisonment for life.\n3. For such felony committed in time of war the punishment- shall be death.\n"}, "SECTION 237": {"title": "POSSESSION AND CARRIAGE ARMS", "content": "1. Whoever without such permission as may be required by law manufactures, exports, imports, keeps, transfers or sells any firearm or ammunition shall be punished with imprisonment for from 3 (three) months to 1 (one) year or with fine of from CFAF 50 000 (fifty thousand) to CFAF 300 000 (three hundred thousand), or with both such imprisonment and fine.\n2. The punishment shall be doubled for carriage of any such arm outside the offender's residence.\n3. Whoever delivers any such arm or ammunition to any person without ascertaining that he is licensed to keep it shall be punished as his accessory.\n4. Confiscation under section 35 of this Code shall be ordered in every case; and on any subsequent conviction within the meaning of section 88 the Court may impose the forfeitures described by section 30 and order the closure of the establishment to whatever other use it may be put.\n"}, "SECTION 238": {"title": "DANGEROUS CARRIAGE OF ARMS", "content": "Whoever whether licensed or not to bear arms shall bear any weapon within the meaning of section 117 of this Code in a place open to the public in manner liable to disturb the public peace or to alarm any person. shall be punished with imprisonment for from 3 (three) months to 2 (two) years or with fine of from CFAF 50 000 (fifty thousand) to CFAF 300 000 (three hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 239": {"title": "DISTURBANCE OF QUIET ENJOYMENT", "content": "Whoever in manner liable to disturb the public peace enters upon land quietly enjoyed by another to whomsoever belonging, shall be punished with imprisonment for from 15 (fifteen) days to 1 (one) year.\n"}, "SECTION 240": {"title": "FALSE NEWS", "content": "1. Whoever publishes or propagates by any means whatever any news without being able to prove either its truth or that he had good reason to believe it to be true, shall be punished with imprisonment for from 1 (one) to 5 (five) years and with a fine of from CFAF 20 000 (twenty thousand) to CFAF 10 000 000 (ten million).\n2. The penalty shall be doubled for anonymous publication or propagation.\n"}, "SECTION 241": {"title": "CONTEMPT OF RACE OR RELIGION", "content": "1. Whoever commits a contempt, within the meaning of section 152 of this Code, of the race or religion of a number of citizens or residents shall be punished with imprisonment for from 6 (six) days to 6 (six) months and with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand).\n2. Where the offence is committed by means of the press or wireless the fine may extend to CFAF 20 000 000 (twenty million).\n3. Where the offence is committed with intent to arouse hatred or contempt between citizens, the penalties provided by the foregoing subsections shall be doubled.\n"}, "SECTION 242": {"title": "DISCRIMINATION", "content": "Whoever excludes another from any place open to the public or from any employment, by reason of his race, religion, sex or health status, where such status does not endanger anyone shall be punished with imprisonment for from 1 (one) month to 2 (two) years and with fine of from CFAF 5 000 five tnousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 243": {"title": "PUBLIC DRUNKENNESS", "content": "1. Whoever:\n- a) commits the offence of public drunkenness within 12 (twelve) months of a previous conviction,\n- b) Shall be licensed to sell alcoholic beverages and delivers any such beverage on his premises to any person manifestly drunk,\nshall be punished with imprisonment for from 15 (fifteen) days to 1 (one) month and with a fine of from CFAF 2 000 (two thousand) to CFAF 35 000 (thirty-five thousand.\n1. Where the offender is so licensed the Court may order closure of his establishment for up to 2 (two) years, and order publication of the judgment.\n"}, "SECTION 244": {"title": "SUBSEQUENT CONVICTIONS", "content": "1. Section 88 (1) (b) of this Code shall apply to any subsequent conviction under the last foregoing section.\n2. The Court may add the forfeitures described by section 30 (1) and (2) of this Code.\n3. Where the offender is so licensed the Court may order closure of his establishment for up to 4 (four) years, and order publication of its judgment.\n"}, "SECTION 245": {"title": "BEGGING", "content": "Whoever, having means of subsistence, or being able to earn such by working, begs in any place for alms shall be punished with imprisonment for from 3 (three) months to 3 (three) years and with fine of from CFAF 50 000 (fifty thousand ) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 246": {"title": "AGGRAVATED BEGGING", "content": "Whoever. whether or not able-bodied and having or not means of subsistence, begs for alms in any of the following manners:\n- a) with abuse, threats, or assault ;\n- b) after entering any dwelling or enclosure thereto appurtenant without the occupant’s permission\n- feigns wounds or a disability in order to attract the generosity or play\nover the intelligence of a third party ,\n- d) in company, save husband and wife, or father and mother with their young children, or a blind man and his guide,\nshall be punished with imprisonment for from 6 (six) months to 6 (six) years and with fine of from CFAF 1 000 (one thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 247": {"title": "VAGRANCY", "content": "1. ) Whoever is found in a public place being of no fixed abode and with no means of support shall be guilty of vagrancy and shall be punished with imprisonment for from 6 (six) months to 2 (two) years.\n2. The punishment prescribed above shall be doubled:\n- a) Where the vagrant is found in possession of any weapon or any instrument with which an offence may be committed;\n- b) Where the vagrant has committed (or attempted to commit) any act of violence against an individual or individuals.\n1. In addition, the measures prescribed under section 42 (1), (2) and (3) shall be pronounced.\n"}, "SECTION 248": {"title": "DANGEROUS PREPARATIONS", "content": "1. Whoever with intent to commit any felony or misdemeanour cames any instrument fit for the forcing of entry to any immovable property shall be punished with imprisonment for from 10 (ten) days to 1 (one) year.\n2. The intent shall be presumed where the facts charged were committed at night.\n"}, "SECTION 249": {"title": "GAMING AND LOTTERIES", "content": "(1) Whoever:\n- a) operates a casino, public lottery or betting establishment without a concession agreement ;\n- b) organizes a commercial lottery or operates online gaming without authorization ;\n- c) uses the operating licence for a casino, public lottery or betting establishment belonging to another ;\n- d) uses the authorization to organize commercial lottery or operate online gaming belonging to another. shall be punished with imprisonment for from 6 (six) months to 2 (two) years or fine of from CFAF 5 000 000 (five million) to CFAF 25 000 000 (twenty-five million) or both such imprisonment and fine.\n1. The penalties provided for in Subsection (1) above shall be applied to\nany operator of a commercial lottery who does not comply with the gaming rules submitted prior to obtaining the authorization.\n"}, "SECTION 249-1": {"title": "FAILURE TO COMPLY WITH THE STANDARDS AND NORMS OF SAFETY, COMFORT AND HYGIENE SPECIFIC TO CASINOS", "content": "Whoever fails to comply with the standards and norms of safety, comfort and hygiene specific to casinos shall be punished with imprisonment for from 2 (two) to 4 (four) years, or fine of from CFAF 5 000 000 (five million) to CFAF10 000 000 (ten million) or both such imprisonment and fine.\n"}, "SECTION 249-2": {"title": "VIOLATION OF THE TERMS OF THE SPÉCIFICATIONS ATTACHED TO A CONCESSION AGREEMENT", "content": "Whoever violates any of the terms of the specifications attached to a concession agreement shall be punished with imprisonment for from 2 (two) to 5 (five) years or fine of from CFAF 10 000 000 (ten million) to CFAF 50 000 000 (fifty million) or both such imprisonment and fine.\n"}, "SECTION 249-3": {"title": "USE OF UNLICENSED EQUIPMENT FOR CASINO OR ONLINE GAMES", "content": "Whoever uses unlicensed equipment to operate a casino or online games shall be punished with imprisonment for from 1 (one) to 3 (three) years or fine of from CFAF 2 500 000 (two million five hundred thousand) to CFAF 10 000 000 (ten million) or both such imprisonment and fine.\n"}, "SECTION 249-4": {"title": "MONEY LAUNDERING THROUGH GAMING AND LOTTERIES", "content": "Whoever engages in money laundering through the operation of a casino, public or commercial lottery, betting or online games, shall be punished with imprisonment for from 5 (five) to 10 (ten) years or fine of from CFAF 50 000 000 (fifty million) to CFAF 100 000 00 (one hundred million) or both such imprisonment and fine.\n"}, "SECTION 249 5": {"title": "RESISTANCE IN GAMING AND LOTTERIES", "content": "Whoever uses violence or assault to prevent sworn officers from\ngaming access to the premises to be inspected shall be punished with imprisonment for from 3 (three) months to 4 (four) years or fine of from CF AF 2 500 000 (two million five hundred thousand) to CFAF 5 000 000 (five million) or with both such imprisonment and fine.\n"}, "SECTION 249-6": {"title": "ADVERTISING IN GAMING AND LOTTERIES", "content": "Whoever. being a licensed operator of money games and games of chance transmits or broadcasts a commercial advertisement by any means whatsoever targeting minors, shall be punished with imprisonment for from 1 (one) to 3 (three) years or fine of from CFAF 10 000 000 (ten million) to CFA 20 000 000 (twenty million) or with both such imprisonment and fine.\n"}, "SECTION 249-7": {"title": "FORBIDDEN ACCESS IN GAMING AND LOTTERIES", "content": "1. Whoever:\n- a) fails to take measures to block access of minors to a casino ;\n- b) allows access to casinos for the following:\n- - military and law and order personnel in uniform ;\n- - persons who are in a drunken State or likely to cause scandais or incidents ;\n- - persons to whom access has been prohibited by the minister in charge of gaming. shall be punished with imprisonment for from 1 (one) to 3 (three) years or fine of from CFAF 5 000 000 (five million) to CFAF 10 000 000 (ten million) or with both such imprisonment and fine.\n1. The penalties provided for in Sub-section (1) above shall be applicable to the operator of online gaming and betting who fails to take the following measures to block access of minors to such gaming and betting:\n- a) post on the gaming site’s home page and registration page, in visible manner, a message explicitly prohibiting access of minors to the gaming service;\n- b) require the player on his honour, to state his age and enter his Personal identity information;\n- c) require the player to use online payment methods;\n- d) have his gaming website submitted to parental control software to block access of minors\n"}, "SECTION 249-8": {"title": "COMPROMISE", "content": "1. The offences provided for under Sections 249 to 249-3 may be subject to compromise between the gaming regulatory entity and the\ndefaulter.\nHowever, compromise shall be possible only in the event of the admission of the offence after it has been established.\n1. The amount of the compromise referred to in Subsection (1) above, shall not be less than the minimum amount of the fine provided for.\n2. The payment of the total amount of the compromise provided for in Subsection (2) above shall extinguish court action.\n"}, "SECTION 249-9": {"title": "ACCESSORY PENALTIES", "content": "In the cases provided for in Sections 249, 249-1, 249-2. 249-3, 249-4, 249-5, 249-6 and 249-7 above, the court may:\n- (a) upon conviction add the forfeitures described by Section 30 of this Code, and order closure of the offender’s establishment, notwithstanding that it may also be put to another use.\n- (b) in addition to confiscation under Section 35 of this Code, order confiscation of all furniture and furnishings adapted or decorated to attract customers, and all funds and movable or immovable property, set aside as prizes for the winners.\n"}, "SECTION 250": {"title": "PAWNSHOPS", "content": "Whoever :\n- a) without such licence as may be lawfully required, keeps any pawnshop or business of lending on a floating charge; or\n- b) having such license fails to keep such registers as may be prescribed;\nshall be punished with imprisonment for from 15 (fifteen) days to 3 (three) months and with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 251": {"title": "PRACTICE OF WITCHCRAFT", "content": "Whoever commits any act of witchcraft, magic or divination liable to\ndisturb public order or tranquility. or to harm another in his person, property or substance, whether by the taking of a reward or otherwise, shall be punished with imprisonment for from 2 (two) to 10 (ten) years, and with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand).\n"}}}, "CHAPTER III": {"title": "PUBLIC ECONOMY", "sections": {"SECTION 252": {"title": "FALSE WEIGHTS AND MEASURES", "content": "Any trader or artificer keeping at his place of trade or work any false weight or measure or other incorrect apparatus used for the weighing or measuring of his wares shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months or with fine of from CFAF 10 000 (ten thousand) to CFAF 700 000 (seven hundred thousand) or with both such imprisonment and fine.\n"}, "SECTION 253": {"title": "CHEQUE WITHOUT COVER", "content": "Whoever:\n- a) issues a cheque on a bank or postal account within or without Republic and without pre-existing, adequate or free cover, or\n- b) after issue withdraws, whether within or without the Republic ail or part of the cover or stops payment,\nshall be punished with the penalties laid down under section 318.\n"}, "SECTION 254": {"title": "AUCTIONS", "content": "Whoever by force or threat, by gift or promise, or by any trick, disturbs the freedom or interferes with the genuineness of any auction or tender shall be punished with imprisonment for from 1 (one) to 6 (six) months and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}, "SECTION 255": {"title": "INTERFERENCE WITH LABOUR", "content": "Whoever by means of force or threat, or by fraudulent trick, causes or prolongs any concerted stoppage of work with intent thereby to compel an increase or decrease of wages or to affect injuriously the freedom of labour or of industry, shall be punished with imprisonment for from 15 (fifteen) days to 3 (three) years or with fine of from CFAF 5 000 (five thousand) to CFAF 7ôf 000 (seven hundred thousand) or with both such imprisonment and fine.\n"}, "SECTION 256": {"title": "RIGGING PRICES", "content": "1. Whoever by any fraudalent means causes an artificial increase or\ndecrease of the price of goods or public or private securities, shall be punished with imprisonment for from 2 (two) months to (2) two years and with fine of from CFAF 400 000 (four hundred thousand) to CFAF 20 000 000 (twenty million).\n2. The penalty shall be doubled where the goods in question are foodstuffs or subject to standards regulations.\n3. On conviction the Court may add the forfeitures described in section 30 (1) and (2) of this Code, and order publication of its judgment.\n"}, "SECTION 257": {"title": "DESTRUCTION OF FOODSTUFFS", "content": "Whoever with intent thereby to influence the market in foodstuffs whether for human or animal consumption causes or permits them to perish, rot or disappear from circulation, shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n"}}}, "CHAPTER IV": {"title": "PUBLIC HEALTH", "sections": {"SECTION 258": {"title": "ADULTERATION OF FOODSTUFFS", "content": "1. Whoever either adulterates any foodstuff, whether for human or animal consumption, or beverage or médicinal substance intended to be sold, or keeps any substance designed or fit only for the purpose of effective such adultération, shall be punished with imprisonment for from 3 (three) months to 3 (three) years and with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand).\n2. This section shall not apply to fresh fruits and vegetables which hâve fermented or become rotten.\n3. Any such foodstuff, beverage or medication belonging to the offender shall be confiscated; and where not used by the Government its destruction shall be at the expense of the offender.\n4. The Court may order publication of ifs judgment under Section 33 of this Code.\n"}, "SECTION 258-1": {"title": "ILLEGAL SALE OF MEDICATION", "content": "Whoever:\n- -sells any medication without lawful authority ;\n- - sells any counterfeited, expired or unauthorized medication ;\n- - keeps for sale, any medication that is falsified, adulterated or harmful to health,\nshall be punished with imprisonment for from 3 (three) months to (3) three years or with fine of from CFAF 1 000 000 (one million) to CFAF 3 000 000 (three million).\nThe confiscation provided for in Sections 35 and 45 of this Code shall apply.\n"}, "SECTION 259": {"title": "FALSE MEDICAL CERTIFICATE", "content": "1. Any physician, surgeon, dresser or nurse, dentist or midwife who for the advantage or disadvantage of any person falsely certifies or conceals the existence of any disease or disability, or falsely certifies the performance or result of an inoculation, or gives misleading information on the origin of a disease, on the duration of a disability, or on the cause of any death, shall be punished with imprisonment for from 2 (two) months to 3 (three) years and with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand).\n2. Where any such person has been corrupted the punishment shall be imprisonment for from 2 (two) to 10 (ten) years.\n3. On conviction the Court may impose the forfeitures described by section 30 of this Code.\n"}, "SECTION 260": {"title": "INFECTIOUS DISEASES", "content": "1. Whoever by his conduct facilitates the communication of any dangerous infectious disease shall be punished with imprisonment for from 3 (three) months to 3 (three) years.\n2. n the case of an infection dangerous to the life of any animal usually intended for human consumption the punishment shall be imprisonment for from 1 (one) month to 1 (one) year.\n"}, "SECTION 261": {"title": "POLLUTION OF AIR AND WATER", "content": "Whoever by his operations:\n- a) pollutes any drinkable water liable to be used by another; or\n- b) so pollutes the atmosphere as to render it harmful to human health,\nshall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months, or with fine of from CFAF 5 000 (five thousand) to CFAF 1 000 000 (one million), or with both such imprisonment and fine.\n"}, "SECTION 262": {"title": "ESSENTIAL SERVICES", "content": "1. Whoever breaks any contract of service or supply in such circumstances that the foreseeable consequence of such breach is either a grave danger to public health or to the health of patients in hospital, or grave bodily injury, or grave danger to property of any nature, or the deprivation of a number of persons of electricity, water, gas or any other source of energy shall be punished with imprisonment for from 1 (one) to 6 (six) months.\n2. This section shall not apply to any person who has given notice of 7 (seven) days or more.\n"}}}, "CHAPTERV": {"title": "PUBLIC DECENCY", "sections": {"SECTION 263": {"title": "PUBLIC INDECENCY", "content": "Whoever publicly offends against decency shall be punished with imprisonment for from 15 (fifteen) days to 2 (two) years or with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 264": {"title": "CORRUPTION OF MORAL", "content": "Whoever : \n- a) publicly utters any immoral song, cry or speech; or\n- b) draws the attention of the public to any occasion of immorality, shall be punished with the penalties provided for in Section 263 above.\n"}, "SECTION 265": {"title": "OBSCENE PUBLICATIONS", "content": "1. Whoever : \n- a} with a view of trade manufactures, keeps imports transports or exports; or\n- b) whether or not for gain, and whether or not publicly, exhibits or\ndistri butes - any writing. picture or object liable to corrupt morals,\nshall be punished with imprisonment for from 1 (one) month to 2 (two) years and with fine of from CFAF (ten thousand) to 1/z (half a million).\n1. On conviction, the Court may order closure for up to one year of the establishment where the offender manufactures or keeps any such writing. picture or object.\n"}, "SECTION 266": {"title": "OTHER OBJECTIONABLE PUBLICATIONS", "content": "1. Whoever publishes any account, save the judgment, of any affiliation, divorce or judicial separation proceeding, or of any prosecution for abortion, shall be punished with fine of from CFAF 20 000 (twenty thousand) to CFAF 6 000 000 (six million).\n2. Whoever without the written permission of the authority responsible for prosecution publishes in any manner the suicide of a person aged under eighteen years shall be punished with fine of from CFAF 20 000 (twenty thousand) to CFAF 2 000 000 (two million); and on subséquent conviction within the meaning of section 88 of this Code, may also be punished with imprisonment for from 2 (two) months to 2 (two) years.\n3. Whoever infringes section 23 (3) of this Code shall be punished with fine of from CFAF 10 000 (ten thousand) to CFAF 1 000 000 (one million).\n4. Whoever publishes, whether by picture or in any other manner, without the written request of the officer preparing prosecution, the whole or any part of the circumstances of an offence of violence or committed against a child or against morals, shall be punished with fine of from CFAE_20-Û00— (twenty thousand) to CFAF 200 000 (two hundred thousand). \n"}, "SECTION 267": {"title": "JUSTIFICATION OF CRIME", "content": "Whoever publicly justifies the felonies of murder, depredation, arson, destruction or felonious theft, or any felony or misdemeanour against the security of the State, shall be punished with imprisonment for from 1 (one) to 5 (five) years. or with fine of from CFAF 10 000 (ten thousand) to CFAF 20 00 000 (twenty million) or with both such imprisonment and fine.\n"}, "SECTION 268": {"title": "CRUELTY TO AN ANIMAL", "content": "1. Whoever causes needless suffering to any animal, whether domestic, tamed or kept in captivity, shall be punished with imprisonment for from 15 (fifteen) days to 3 (three) months, or with fine of from CFAF 5 000 (five thousand) to CFAF 20 000 (twenty thousand), or with both such imprisonment and fine.\n2. On conviction, the Court may deprive the offender of ownership of the animal.\n3. Where the condition of the animal renders such an order proper. the Court may order its destruction.\n"}, "SECTION 268-1": {"title": "SEXUAL INTERCOURSE ON AN ANIMAL", "content": "1. Whoever has sexual intercourse on an animal shall be punished with imprisonment for from 3 (three) to 5 (five) years.\n2. Whoever, by force or moral ascendency, compels any person to have sexual intercourse on an animal shall be punished with imprisonment for from 5 (five) to 10 (ten) years.\n3. In cases provided for in Subsection (2) above, the Court may also order the offender to bear the cost of medical treatment of the victim.\n"}}}, "CHAPTER VI": {"title": "PUBLIC WORSHIP", "sections": {"SECTION 269": {"title": "FREEDOM OF CONSCIENCE", "content": "Whoever by any interference or threat compels or prevents the practice of any form of religion which does not involve the commission of a criminal offence, shall be punished with imprisonment for from 1 (one) month to 1 (one) year and with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand).\n"}, "SECTION 270": {"title": "CONTEMPT OF MINISTER OF RELIGION", "content": "Whoever strikes or publicly insults a minister of religion on account of his ministry shall be punished with imprisonment for from 1 (one) month to 3 (three) years.\n"}, "SECTION 271": {"title": "VIOLENT OBSTRUCTION OF MINISTRY", "content": "Whoever obstructs by assault or threat the exercise of his ministry by a minister of religion shall be punished in like manner.\n"}, "SECTION 272": {"title": "DISTURBANCE OF PUBLIC WORSHIP.", "content": "Whoever by disturbance or disorder obstructs, delays or interrupts religious worship in the place where it is customarily offered.\nshall be punished with imprisonment for from 15 (fifteen) days to 1 (one) year or with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 273": {"title": "DISTURBANCE OF FUNERAL", "content": "Whoever: \n- a) disturbs any funeral ceremony or procession; or\n- b) defaces any funerary monument; or\n- c) fails to perform any duty by which he is bound to bury or burn a corpse ;\nshall be punished with imprisonment for from 1 (one) to 6 (six) months or with fine of from CFAF 5 000 (five thousand) to CFAF 25 000 (twenty five thousand), or with both such imprisonment and fine.\n"}, "SECTION 274": {"title": "VIOLATION OF GRAVES AND CORPSES", "content": "1. Whoever: \n- a) violates any tomb or place of burial; or\n- b) offers indignity to any human corpse or part thereof, whether buried or not,\nshall be punished with imprisonment for from 3 (three) months to 5 (five) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n1. Nothing in this section shall apply to any dealing with a corpse in the interests of science and in accordance with any regulation in force. \n2. Whoever has sexual intercourse on a corpse shall be punished with imprisonment for from 3 (three) months to 5 (five) years.\n3. Whoever, by force or moral ascendency. compels any person to have sexual intercourse on a corpse shall be punished with imprisonment for from 5 (five) to 10 (ten) years.\n"}}}}}, "PART III": {"title": "FELONIES AND MISDEMEANOURS AGAINST PRIVATE INTEREST", "chapters": {"CHAPTER I": {"title": "THE PERSON", "sections": {"SECTION 275": {"title": "MURDER", "content": "Whoever causes another’s death shall be punished with imprisonment for life.\n"}, "SECTION 276": {"title": "CAPITAL MURDER", "content": "1. Whoever commits murder : \n- a) after premeditation; or\n- b) by poisoning; or\n- c) with a view to trafficking the organs of the victim;\n- d) in the preparation, facilitation or commission of a felony or misdemeanour. or to enable the escape or to procure the impunity of the offender or of an accessory to such felony or misdemeanour,\nshall be punished with death.\n1. Murder shall be deemed premeditated notwithstanding that the identity of the victim is not decided or that the enterprise depends on the fulfilment of a condition.\n"}, "SECTION 277": {"title": "GRIEVOUS HARM", "content": "Whoever permanently deprives another of the use of the whole or of\nany part of any member, organ or sense shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\n"}, "SECTION 277-1": {"title": "GENITAL MUTILATION", "content": "1. Whoever mutilates the genital organ of a person, by any means whatsoever, shall be punished with the penalties provided for in Section 277 above:\n2. The penalty shall be imprisonment for life where: \n- a) the offender habitually carries out such practice or does so for commercial purposes;\n- b) it leads to the death of the victim.\n1. The Court may also impose the forfeitures provided for in Sections 19 and 30 of this Code.\n2. The provisions of Sub-sections 1 and 2 above shall not apply where the acts were performed by a qualified person and in order to save life.\n"}, "SECTION 277-2": {"title": "PREVENTION OF GROWTH OF ORGAN", "content": "Whoever. in any manner whatsoever, interferes with an organ in order to inhibit its normal growth shall be punished with imprisonment for from 6 (six) months to 5 (five) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 1 000 000 (one million) or with both such imprisonment and fine.\n"}, "SECTION 277 -3": {"title": "TORTURE", "content": "1. Whoever involuntarily causes death by torture shall be punished with life imprisonment.\n2. The penalty shall be imprisonment for from 10 (ten) to 20 (twenty) years where torture causes a permanent deprivation of the use of ail or part of a limb, organ or sense.\n3. The penalty shall be imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 1 000 000 (one million) where torture leads to illness or incapacity to work of more than 30 (thirty) days.\n4. The penalty shall be imprisonment for from 2 (two) to 5 (five) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 200 000 (two hundred thousand) where torture leads to illness or incapacity to work of up to 30 (thirty) days, or pain or mental or psychological injury.\n5. For the purposes of this section torture shall mean any act by which acute pain or suffering, either physical, mental or psychological, is intentionally inflicted to a person by a public servant, a traditional leader or any other person acting in the course of duties either at his own instigation or with his express or implied consent, in order to obtain information or confessions from that person or from another, to punish her for an act that she or any other person has committed. or is presumed to have committed, to intimidate or overawe her or any other person, or for any other motive based on any discrimination.\nThe word “torture\" as so defined does not apply to pain or suffering resulting from legitimate punishments, inherent to or caused by them.\n1. No exceptional circumstances, whatever they are, whether a state of war or threat of war, internal political stability or State of exception, may be invoked to justify torture.\n2. Torture may not be justified by command of a superior or public authority.\n3. The requirements provided in section 10 (1) of this Code shall not be applicable to torture.\n"}, "SECTION 278": {"title": "ASSAULT OCCASIONING DEATH", "content": "1. Whoever by force or interference unintentionally causes another’s death shall be punished with imprisonment for from 6 (six) to 20 (twenty) years.\n2. Where the force or interference is used in the course of any act of witchcraft, magic or divination the punishment shall be imprisonment for life.\n"}, "SECTION 279": {"title": "ASSAULT OCCASIONING GRIEVOUS HARM", "content": "1. Whoever by force or interference unintentionally causes to another the injuries described in section 277 of this Code shall be punished with imprisonment for from 5 (five) to 10 (ten) years and in a fit case with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand).\n2. Where use is made of a weapon, of any explosive corrosive or toxic substance of poison, or of any act of witchcraft magic or divination the imprisonment shall be from 6 (six) to 15 (fifteen) years.\n"}, "SECTION 280": {"title": "SIMPLE HARM", "content": "Whoever by force or interference causes intentionally or unintentionally\nto another any sickness or inability to work lasting more than 30 (thirty) days shall be punished with imprisonment for from 6 (six) months to 5 (five) years or with fine of from CFAF 5 000 (five thousand) to 200 000 (two hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 281": {"title": "SLIGHT HARM", "content": "Whoever by force or interference causes intentionally or unintentionally to another any .sickness or inability to work lasting for more than 8 (eight) days and up to 30 (thirty) days shall be punished with imprisonment for from 6 (six) days to 2 (two) years or with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand), or with both such imprisonment and fine.\n"}, "SECTION 282": {"title": "DESERTION OF INCAPABLE", "content": "1. Whoever with intent to abandon him removes any person unable to protect himself by reason of his physical or mental condition shall be punished with imprisonment for from 1 (one) to 3 (three) years and with fine of from CFAF 5 000 (five thousand) to CFAF 25 000 (twenty-five thousand).\n2. Where the abandonment is in a lonely place the punishment shall be imprisonment for from 5 (five) to 10 (ten) years.\n3. Where the offender is an ascendant or any other person having authority over the incapable or having custody of him. whether by law or in fact, the punishment shall be imprisonment for from 10 (ten) to 20 (twenty) years.\n4. Upon conviction under this section the court may impose the forfeitures described by section 30 of this Code and may also deprive the offender of parental power for the same period.\n"}, "SECTION 283": {"title": "FAILURE TO ASSIST", "content": "Whoever fails to render assistance to a person in danger of death or grievous harm, whether by his own endeavours or by calling for help, where such assistance involves no risk to himself or to any other person, shall be punished with imprisonment for from 1 (one) month to 3 (three) years or with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million) or with both such imprisonment and fine.\n"}, "SECTION 284": {"title": "MISTAKE AS TO VICTIM", "content": "For the purposes of Sections 275 to 281 inclusive the infliction of death or the use of force or interference shall be treated as intentional notwithstanding that it is intended to be inflicted on or used against a different person.\n"}, "SECTION 285": {"title": "CONSTRUCTIVE FORCE", "content": "For the purposes of this Code the following shall be treated as the use of force or as interference:\n- a) the administration of any substance harmful to health ;\n- b) desertion under section 282 ;\n- c) deprivation of nourishment or care, to a degree endangering health, by a person having custody in law or in fact of another who is either incapable of withdrawing himself from the said custody or incapable of providing for himself.\n"}, "SECTION 286": {"title": "MEDICAL TREATMENT", "content": "Sections 277 to 281 inclusive shall not apply to the professional services of any person duly authorized to render them, where performed with the consent either of the patient or of such person as may have custody of him:\nProvided that where the patient is incapable of consent his spouse may consent on his behalf, and where communication with the said spouse or person having custody is impossible without risk to the patient, consent shall not be necessary.\n"}, "SECTION 287": {"title": "INTEREST OF VICTIM", "content": "The infliction of harm and the use of force shall constitute no offence where proved to be justified by the immediate necessity of avoiding greater harm to the victim.\n"}, "SECTION 288": {"title": "SPORT", "content": "Sections 278 to 281 inclusive shall not be applicable to anything done in\nthe course of a sport and in accordance with its rules.\n"}, "SECTION 289": {"title": "UNINTENTIONAL KILLING AND HARM", "content": "1. Whoever by lack of due skill, carelessness, rashness or disregard of regulation causes another’s death or such harm, sickness or incapacity as is described in section 277 or 280 shall be punished with imprisonment for from 3 (three) months to 5 (five) years or with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand), or with both such imprisonment and fine.\n2. Where such harm, sickness or incapacity as is described in Sections 277 or 280 is caused by an offence against section 227 or 228 (2) (a) or (b) the imprisonment shall be from 6 (six) to (20) twenty years.\n3. Where another’s death is caused by an offence against Sections 227or 228 (2) (a) or (b), the punishment shall be imprisonment for life.\n4. Where any offence against this section is committed in the course of driving a vehicle requiring a driving license, the Court may disqualify the offender for up to 3 (three) years from holding such license and for any subsequent offence within the meaning of Section 88 of this Code may disqualify him for up to 10 (ten) years.\n"}, "SECTION 290": {"title": "DRIVERS OF VEHICLES", "content": "1. The punishment provided by section 289 (1) shall be doubled for an offence committed by the driver of any vehicle\n- a) who is drunk or drugged when driving ; or\n- b) who has not the license required for driving the vehicle in question ; or\n- c) who with intent to avoid his liability departs before being identified,\n1. Where such harm as is described in section 281 is caused unintentionally in the circumstances of the last foregoing subsection, the driver shall be punished with imprisonment for from 6 (six) months to 4 (four) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n2. For any offence against this section, the Court may disqualify the offender for up to five years from holding a driving license; and on subsequent conviction within the meaning of Section 88 of this Code may disqualify him for life or for any lesser term.\n3. In any case not covered by subsection (1) (c) of this section, the\ndriver of any vehicle involved in an accident who with intent to avoid his liability départs before being identifiée! shall be punished with imprisonment for from 1 (one) month to 1 (one) year and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand); and the Court may disqualify him for up to 2 (two) years from holding a driving license.\n"}}}, "CHAPTER II": {"title": "PRIVATE LIBERTY AND TRANQUILITY", "sections": {"SECTION N 291": {"title": "FALSE ARREST", "content": "1. Whoever in any manner deprives another of his liberty shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million).\n2. The punishment shall be imprisonment for from 10 (ten) to 20 (twenty) years in any of the following cases:\n- a) where the deprivation of liberty lasts for more than a month; or\n- b) where it is accompanied with physical or mental torture; or\n- c) where the arrest is effected with the aid of a forged order from a public authority or of a uniform unlawfully worn, or pretending an appointment not held.\n"}, "SECTION 292": {"title": "FORCED LABOUR", "content": "Whoever for his Personal advantage compels another to do any work or to render any service which he has not offered of his own free will shall be punished with imprisonment for from 1 (one) to 5 (five) years or with fine of from CFFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 293": {"title": "SLAVERY", "content": "Whoever enslaves any person or keeps him in slavery shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years.\nThe Court may in addition impose the forfeitures described in Section 30 of this Code.\n"}, "SECTION 294": {"title": "IMMORAL EARNINGS", "content": "1. Whoever procures, aids or facilitates another persons’ prostitution, or shares in the proceeds of another’s prostitution, whether habitual or otherwise, or who is subsidized by any person engaging in prostitution shall be punished with imprisonment for from 6 (six) months to 5 (five) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million).\n2. Whoever lives with a person engaging in prostitution shall be presumed to be subsidised by her, unless he shows that his own resources are sufficient to enable him to support himself.\n3. The punishment shall be doubled where: \n- a. the offence is accompanied; by coercion or by fraud or where the offender is armed; or where he is the owner, manager or otherwise in charge of an establishment where prostitution is habitually practiced;\n- b. where the offence has been committed to the detriment of any person under the age of 21 (twenty-one);\n- c. where the offender is the father or mother, guardian or person with customary responsibility.\n1. In the cases referred to under subsection 3, the provisions of section 48 shall be applied.\n2. The court may impose the forfeitures described by Section 30 of this Code and disqualify the offender for the same period from being guardian or curator of any person and from having custody, customary or otherwise, of any person under the age of 21 (twenty-one).\n3. Upon conviction under subsection 3 (a) of this section, the court shall order closure of the establishment, to whatever other use it may be put.\n4. The prostitute herself shall not be treated as accessory to any offence under this section.\n"}, "SECTION 295": {"title": "PRIVATE INDECENCY", "content": "1. Whoever in any place, notwithstanding that it may not be open to the public, commits an indecent act in the presence of any person of either sex and without his consent shall be punished with imprisonment for from 15 (fifteen) days to 2 (two) years or with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand). or with both such imprisonment and fine.\n2. The punishment shall be doubled where the offence is accompanied by assault.\n"}, "SECTION 296": {"title": "RAPE", "content": "Whoever by force or moral ascendency compels any person, whether above or below the age of puberty, to have sexual intercourse with him shall be punished with imprisonment for from 5 (five) to 10 (ten) years.\n"}, "SECTION 297": {"title": "SUBSEQUENT MARRIAGE", "content": "Marriage freely consented between the offender and the victim, even where she is over puberty at the time of commission of the offence provided for in Sections 295 and 296 above, shall have no effect on the prosecution and conviction.\n"}, "SECTION 298": {"title": "AGGRAVATION", "content": "The penalties prescribed by Sections 294, 295 and 296 shall be doubled where the offender:\n- a) has authority over the victim, or custody of him by law or by custom; or\n- b) is a public servant or minister of religion; or\n- c) is helped by one or more others.\n"}, "SECTION 299": {"title": "INVASION OF RESIDENCE", "content": "1. Whoever enters or remains m another's résidence agamst his will shall be punished with imprisonment for from 10 (ten) days to 1 (one) year or with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand).\nor with both such imprisonment and fine.\n2. The penalty shall be doubled for an offence committed at night or with the aid of force, threats or other interference.\n3. No prosecution may be commenced without the complaint of the injured party.\n"}, "SECTION 300": {"title": "TAMPERING WITH CORRESPONDENCE", "content": "1. Whoever without permission from the addressee destroys, conceals or opens another's correspondence shall be punished with imprisonment for from 15 (fifteen) days to 1 (one) year or with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine.\n2. This Section shall not apply between spouses, to parents in respect of their children under 21 (twenty-one) years of age and unemancipated, or to guardians or persons responsible by custom in respect of their wards.\n"}, "SECTION 301": {"title": "SIMPLE THREATS", "content": "Whoever orally or by any writing or picture threatens another with force or interference, or with the destruction of any property, or with breaking into his residence, shall be punished with imprisonment for from 10 (ten) days to 3 (three) years and with fine of from CFAF 5 000 (five thousand) to CFAF 150 000 (one hundred and fifty thousand).\n"}, "SECTION 302": {"title": "CONDITIONAL THREATS", "content": "1. Whoever threatens another, expressly or by implication; with force or other interference in case of his failure to comply with any order or condition shall be punished with imprisonment for from 10 (ten) days to 6 (six) months and with fine of from CFAF 5 000 (five thousand) to CFAF 25 000 (twenty-five thousand).\n2. Where the force or other interference would constitute a felony punishable with death or with imprisonment for life, the punishment shall be:\n- a) imprisonment for from 6 (six) months to 3 (three) years and fine of from CFAF 5 000 (five thousand) to CFAF 70 000 (seventy thousand) for\nverbal threats,\n- b) imprisonment for from 2 (two) to 5 (five) years and fine of from CFAF 10 000 (ten thousand) to CFAF 250 000 (two hundred and fifty thousand) for\nthreats in writing or picture; and the Court may in addition impose the forfeitures described in section 30 of this Code.\n"}, "SECTION 302-1": {"title": "SEXUAL HARASSMENT", "content": "1. Whoever takes advantage of the authority conferred on him by his position to harass another using orders. threats, constraints or pressure in order to obtain sexual favours, shall be punished with imprisonment for from 6 (six) months to 1 (one) year and with fine of from CFAF (one hundred thousand) to CFAF 1 000 000 (one million).\n2. The penalty shall be imprisonment for from one to 3 (three) years where the victim is a minor.\n3. The penalty shall be imprisonment for from 3 (three) to 5 (five) years where the offender is in charge of the education of the victim.\n"}, "SECTION 303": {"title": "BLACKMAIL", "content": "1. Whoever threatens another with a defamatory imputation or with any revelation in case of his failure to comply with any order or condition shall be punished with imprisonment for from one to 5 (five) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million).\n2. The penalty shall be doubled for imputation of a felony. \n3. The Court may in addition impose the forfeitures described in Section 30 of this Code.\n"}, "SECTION 304": {"title": "FALSE REPORT", "content": "1. Whoever makes to any person in authority, whether public or private, a false report liable to lead to prosecution or to disciplinary measures shall be punished with imprisonment for from 6 (six) months to 5 (five) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 1 000 000 (one million), unless he shows that he had good reason to believe the report to be true.\n2. Imprisonment shall be for from 2 (two) to 5 (five) years when the faise report is anonymous\n3. Where in consequence of the report a criminal prosecution is commenced in the trial court in respect of the facts reported. any prosecution for false report shall be stayed until final judgment.\n4. The Court may order publication of its judgment.\n"}, "SECTION 305": {"title": "DEFAMATION", "content": "1. Whoever by any of the means described in Section 152 injures the honour or reputation of another by imputations, direct or indirect, of tacts which he is unable to prove shall be punished with imprisonment for from 6 (six) days to 6 (six) months and with a fine of from CFAF 5 000 (five thousand) to CFAF 2 000 000 (two million), or with only one of the penalties.\n2. These penalties shall equally apply to persons guilty of defamation in the print and audio-visual media without prejudice to the right of reply and to the obligation to publish corrections.\n3. No proof may be offered of the truth of defamatory imputation where:\n- a) it concerns the private life of the person defamed; or\n- b) it refers to a fact more than ten years old; or\n- c) it refers to a fact constituting an offence which has been amnestied or the conviction for which has been otherwise expunged.\n1. No prosecution may be commenced without the complaint of the injured party or of his representative by law or by custom, or continued after withdrawal of the complaint.\n2. Prosecution shall be barred by the lapse of four months from commission of the offence or from the last step in preparation or prosecution.\n3. This section shall apply to defamation of the memory of a deceased person with intent to injure the honour or reputation of his living heirs, spouse or universal legatee.\n4. The penalty shall be halved for a defamation which is not public.\n5. The penalty shall be doubled for anonymous defamation.\n"}, "SECTION 306": {"title": "EXCEPTIONS TO DEFAMATION", "content": "The following shall constitute no offence:\n1. speeches within any legislative assembly, and any reports or other documents printed by order of any such assembly ;\n2. faithful accounts without malice of the public sittings of Parliament any such assembly ;\n3. proceedings in court and the speeches made and documents produced in court ;\n4. faithful accounts without malice of ail such proceedings and speeches, save of prosecution or action for defamation ;\n5. publication of any judgment or judicial order, including those passed in a prosecution or action for defamation ;\n6. an official report without malice by a person lawfully appointed to conduct an enquiry to the extent that it is germane to the enquiry ;\n7. imputations without malice by a superior on his subordinate ;\n8. information on any person given without malice to a third party having an interest. Personal or official, in receiving it, or having power to remedy an alleged injustice ;\n9. criticism of any work of art, entertainment or opinion shown or expressed in public, provided that such criticism be not an expression of Personal animosity ;\n10. any work of a historical nature and without malice.\n"}, "SECTION 307": {"title": "ABUSE", "content": "1. Whoever uses without having been provoked against any person in the circumstances of publicity described in section 152 any insulting expression, or contemptuous gesture or words, or invective without imputation of fact, shall be punished with imprisonment for from 5 (five) days to 3 (three) months or, with fine of from CFAF 5 000 (five thousand) to CFAF 100 000 (one hundred thousand), or with both such imprisonment and fine.\n2. No prosecution may be commenced without the complaint of the injured party or of his representative by law or by custom, or continued after withdrawal of the complaint.\n3. Prosecution shall be barred by the lapse of four months from the commission of the offence or from the last step in preparation or prosecution.\n4. This section shall apply to abuse of the memory of deceased person in the circumstances prescribed by section 305 (5).\n"}, "SECTION 308": {"title": "EXTORTION OF DISPOSITION OR SIGNATURE", "content": "1. Whoever by force, coercion or fraud extorts the signature or the delivery of any document having the effect of an obligation, discharge or\ndisposition, or otherwise liable to harm the signatory in his person or in his substance, Shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand).\n2. Whoever procures by the like means the delivery of a signed blank paper and fills it up with any obligation, discharge or disposition shall be punished in like manner.\n"}}}, "CHAPTER III": {"title": "CONFIDENCE", "sections": {"SECTION 309": {"title": "SIGNATURE IN BLANK", "content": "Whoever, being entrusted with a signed blank paper takes advantage of it to insert any unauthorized obligation, discharge or disposition or any other writing liable to harm the signatory in his person or in his substance, shall be punished with imprisonment for from 1 (one) to 5 (five) years or with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand), or with both such imprisonment and fine.\n"}, "SECTION 310": {"title": "PROFESSIONAL CONFIDENCE", "content": "1. Whoever without permission from the person interested in secrecy reveals any confidential tact which has come to his knowledge or which has been confided to him solely by reason of his profession or duties shall be punished with imprisonment for from 3 (three) months to 3 (three) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 100 000 (one hundred thousand).\n2. Subsection (1) shall apply neither to statements to the prosecution or police concerning facts which may amount to a felony or misdemeanour, nor to answers in court to any question whatever.\n3. Nothing in subsection (2) shall release from the duty of professional\nconfidence:\n4. The Court may in addition impose the forfeitures described in Section 30 of this Code\n"}, "SECTION 313-1": {"title": "NON-DECLARATION OF CONFLICT OF INTEREST", "content": "Whoever. being an employée of the public or pnvate sector, personally\nor through a third party or under any name whatsoever, has vested interests in an enterprise or a sector placed under his direct supervision or that relates to him, that may compromise or restrict his independence, but fails to inform his superiors, shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million). \n"}, "SECTION 314": {"title": "FORGERY", "content": "1. Whoever forges or alters, whether in its substance or in the signatures of the parties or witnesses or in its date, any private document having the effect of an obligation, discharge or disposition shall be punished with imprisonment for from 3 (three) to 8 (eight) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF (one million).\n2. The penalty shall be imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 2 000 000 (two million) where the document is:\n- a) commercial or bank paper; or\n- b) evidence of a right in land; or\n- c) a power to sign any document described by subsection (a) or (b); or\n- d) a will.\n1. Whoever makes use of : \n- a) any document described in this section: or\n- b) of an expired document of like nature representing it to be still be effective; or\n- c) of a document of like nature referring to another person of whom he passes himself off- shall be punished in like manner as if he had forged the document.\n- a) a physician or surgeon save within the scope of a commission fro^ the prosecution or of his reference as an expert referee\n- b) a public servant under orders in writing from the Government.\n- c) a minister of religion or counsel,\n1. Upon conviction the Court may order the forfeitures described by\nSection 30 of this Code.\n"}, "SECTION 311": {"title": "COMMERCIAL CONFIDENCE", "content": "1. Whoever reveals without permission from the person interested in secrecy any confidential fact or process which has come to his knowledge or which has been confided to him solely by reason of his employment in an industrial or commercial undertaking shall be punished with imprisonment for from 3 (three) months to 3 (three) years or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 5 000 000 (five million), or with both such imprisonment and fine.\n2. Upon conviction the Court may order the forfeitures described by section 30 of this Code.\n"}, "SECTION 311-1": {"title": "NON-OBSERVANCE OF CONDITIONS FOR REGISTRATION IN THE TRADE AND PERSONAL PROPERTY CRÉDIT REGISTER", "content": "Whoever is bound to fulfil any condition for registration in the Trade and Personal Property Crédit Register and who fails to do so or does so by fraud, shall be punished with imprisonment for from three 3 (months) to 3 (three) years or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 5 000 000 (five million), or with both such imprisonment and fine.\nThe competent Court shall, where necessary, order the rectification of inaccurate entries and transcripts.\n"}, "SECTION 311- 2": {"title": "FAILURE TO INDICATE THE STATUS OF LEASE MANAGER OF A BUSINESS", "content": "Any lease manager of a business who omits to indicate such status at the top of his purchase orders. invoices, and other financial or commercial documents as well as his registration number in the Trade and Personal Property Crédit Register shall be punished with imprisonment for from 3 (three) months to 3 (three) years or with fine of from CFAF 100 000 (one hundred thousand) to CFAF 5 000 000 (five million), or with both such imprisonment and fine.\n"}, "SECTION 314-1": {"title": "ACCOUNTING IRREGULARITES", "content": "1. Whoever deliberately draws up off record accounts. uses faise\ndocuments records false income and expenses or destroys accounting documents earlier than provided for by law, shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 200 000 (two hundred thousand) to CFAF 2 000 000 (two million).\n2. The penalties provided for in Subsection (1) above shall be doubled where the offender is an officially recognized professional accountant or where the accounts produced were certified as true and fair by such professional.\n3. Where false accounts are drawn up or certified with intent to conceal acts of corruption or misappropriation of public property, the penalties shall be those applicable to such offences.\n"}, "SECTION 315": {"title": "FALSE OR FORGED CERTIFICATE", "content": "1. Whoever forges or alters a private certificate or issues a false certificate, where such issue is not otherwise punished, or who makes use of a forged, altered or false private certificate shall be punished with imprisonment for from 1 (one) month to 1 (one) year.\n2. The penalty provided for in Subsection (1) above shall be doubled for forgery, alteration, or use of a medical certificate or of any private document not described by Section 314.\n"}}}, "CHAPTER IV": {"title": "CHILDREN AND THE FAMILY", "sections": {"SECTION 337": {"title": "ABORTION", "content": "1. Any woman procuring or consenting to her own abortion shall be punished with imprisonment for from 15 (fifteen) days to 1 (one) year or with fine of from CFAF 5 000 (five thousand) to CFAF 200 000 (two hundred thousand) or with both such imprisonment and fine.\n2. Whoever procures the abortion of a woman. notwithstandmg her consent, shall be punished with imprisonment for from 1 (one) to 5 (five years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF\n2 000 000 (two million).\n3. The penalties prescribed by Subsection (2) shall be doubled where\nthe offender:\n- a) engages habitually in abortion ; or\n- b) practises the profession of medicine or an allied profession.\n1. In the circumstances of Subsection (3) (b), the Court may also order closure of the professional premises and impose a ban on his occupation under Sections 34 and 36 of this Code.\n"}, "SECTION 338": {"title": "ASSAULT ON WOMAN WITH CHILD", "content": "Whoever by force used against a woman with child or against a child being born causes, intentionally or unintentionally the death or permanent incapacity of the child shall be punished with imprisonment for form 5 (five) to 10 {ten) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 2 000 000 (two million).\n"}, "SECTION 339": {"title": "SAVING MOTHER", "content": "1. Neither of the two foregoing Sections apply to acts performed by a qualified person and proved necessary for the saving of the mother from grave danger to her health.\n2. In case of pregnancy resulting from rape, abortion by a qualified medical practitioner after certificate by the prosecution of a good case shall constitute no offence.\n"}, "SECTION 340": {"title": "INFANTICIDE", "content": "The punishment for murder within the meaning of Sections 275 or 276 or for abetment of such murder. by a mother of her child one month of birth shall be reduced to imprisonment for from 5 (five) to 10 (ten) years. Provided that nothing in this Section shall reduce the penalty as against any other offender or accessory.\n"}, "SECTION 341": {"title": "CLOUD ON PARENTAGE", "content": "Any person whose conduct bas the result of depriving a child of the evidence of his true parentage shall be punished with imprisonment for from 5 (five) to 10 (ten)years.\n"}, "SECTION 342": {"title": "DEBT BONDAGE OF PERSONS", "content": "1. Whoever subjects a person to debt bondage shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 500 000 (five hundred thousand).\n2. The penalties provided in Subsection (1) above shall be doubled where the offender is either an ascendant, a guardian or a person having even customary custody over the victim.\n3. Whoever boards a person in debt bondage shall be punished with imprisonment for 10 (ten) years and with fine of from CFAF 10 000 (ten thousand) to CFAF 1 000 000 (one million),\n4. The court may also impose the forfeitures provided for in Section 30 of this Code.\n"}, "SECTION 342-1": {"title": "TRAFFICKING AND SLAVERY OF PERSONS", "content": "1. Whoever engages even occasionally in the practice of trafficking in persons or slavery shall be punished with imprisonment for from 10 (ten) to 20 (twenty) years and with fine of from CFAF 50 000 (fifty thousand) to CFAF 1 000 000 (one million).\n2. Whoever engages in trafficking in persons and slavery shall be punished with imprisonment of from 15 (fifteen) to 20 (twenty) years and with fine of from CFAF 100 000 (one hundred thousand) to CFAF 10 000 000 (ten million) where the:\n- a) offence is committed against a minor of 15 (fifteen) years old ;\n- b) perpetrator is a legitimate, natural or adopted ascendant of the II victim;\n- c) offender has authority over the victim or is expected to participate by virtue of his duties in the fight against slavery or in peace | keeping ;\n- d) offender is committed by an organized gang or an association of criminals;\n- e) offence is committed with use of a weapon ,\n- f) victim sustains injuries as described in Section 277 of this. Code or\n- g) where the victim dies as a result of acts related to the offence.\n1. The Court may also impose the forfeitures provided for m Section\n30 of this Code.\n"}, "SECTION 343": {"title": "IMMORAL EARNINGS", "content": "1. Whoever, of either sex, who engages habitually for gain, in sexual intercourse with another shall be punished with imprisonment for from 6 (six) months to 5 (five) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 500 000 (five hundred thousand).\n2. Whoever, in view of prostitution of or debauchment, proceeds with public gestures. words and writing or by any other means to the soliciting of persons of either sex shall be punished in like manner.\n"}, "SECTION 344": {"title": "CORRUPTION OF YOUTH", "content": "1. Whoever, in order to satisfy the desires of another person, habitually excites, encourages or facilitates the debauch or corruption of any person under 18 (eighteen) years of age shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 1 000 000 (one million).\n2. The penalty shall be doubled where the victim is under 16 (sixteen) years.\n3. Upon conviction, the Court may order the forfeitures described in Section 30 of this Code and deprive the offender for the same period of parental power and disqualify him from being guardian or curator of any minor.\n"}, "SECTION 345": {"title": "MORAL DANGER", "content": "Whoever having by law or by custom custody of a person under 18 (eighteen) years of age allows him to reside or work in an establishment where prostitution is habitually practiced, or to work in a prostitute's house shall be punished with imprisonment for from 15 (fifteen) days to 6 (six) months and with fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand).\n"}, "SECTION 346": {"title": "INDECENCY TO CHILD UNDER SIXTEEN", "content": "1. Whoever commits an indecent act in the presence of a child under\nthe age of 16 (sixteen) shall be punished with imprisonment for from 2 (two) to 5 (five) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand).\n2. The penalty shall be doubled where the offence is accompanied by\nassault or where the offender is one of the persons described in Section 298.\n3. The penalty shall be imprisonment for from 10 (ten) to 15 (fifteen) years where the offender has sexual intercourse with the victim notwithstanding his or her consent.\n4. In case of rape, the imprisonment shall be from fifteen to twenty-five years, or for life where the offender is one of the persons described by Section 298.\n5. Upon conviction under this Section, the Court may deprive the offender of parental power and disqualify him from being guardian or curator of any minor for the time prescribed by Section 31 (4) of this Code.\n"}, "SECTION 347": {"title": "INDECENCY TO MINOR BETWEEN SIXTEEN AND TWENTY-ONE", "content": "1. For any offence under Sections 295, 296 and 347-1 of this Code committed against a person over 16 (sixteen) and under 21 (twenty-one) years of age, the penalty shall be doubled.\n2. Upon conviction under this Section, the Court may deprive the offender of parental power and disqualify him from being guardian or curator of any minor for the time prescribed by Section 31 (4) of this Code.\n"}, "SECTION 347-1": {"title": "HOMOSEXUALITY", "content": "Whoever has sexual relations with a person of the same sex shall be punished with imprisonment for from 6 (six) months to 5 (five) years and a fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand).\n"}, "SECTION 348": {"title": "DRINK", "content": "1. Whoever:\n- a) being licensed to sell intoxicating liquor for consumption on the promises admits to the said premises any person under 16 (sixteen) years of age not accompanied by a person over 21 'twenty-one) responsible for superintending him or\n0) being licensed to sell beverages for consumption on the promises sells or offers, whether on the said premises or in any other public place any intoxicating liquor to any person under 18 (eighteen) years of age not accompanied by a person over 21 (twenty-one) responsible for\nsuperintending him; or\nc) makes any person under 21 (twenty-one) years of âge drunk, shall be pumshed with fine of from CFAF 5 000 (five thousand) to CFAF 50 000 (fifty thousand).\n1. Upon subsequent conviction within the meaning of Section 88of this Code, the punishment shall be imprisonment for from 15 (fifteen) days to 1 (one) month and fine of from CFAF 10 000 (ten thousand) to CFAF 100 000 (one hundred thousand); and the Court may in addition order:\n- a) closure of the licensed premises under Section 34 of this Code ;\n- b) publication of its judgment ;\n- c) as against any offender the forfeitures described in Section 30 of this Code.\n1. This Section shall not apply to any person proving that he was misled as to the age of the minor or as to the age or authority of the person accompanying him.\n"}, "SECTION 349": {"title": "ADVANTAGE OF WEAKNESS", "content": "1. Whoever takes advantage of the needs, weakness or passions of any person under 21 (twenty-one) years of age to induce him to sign any obligation, discharge or disposition, or any other document liable to harm the signatory in his person or in his substance, shall be punished with the penalty prescribed by Section 318 of this Code. \n2. For the purposes of this Section, any lunatic notorious or so found and any spendthrift so found , shall be treated as a minor.\n"}, "SECTION 350": {"title": "ASSAULT ON CHILDREN", "content": "1. The penalties prescribed by Section 275 on the one hand and by Sections 277 and 278 on the other shall become death and imprisonment for life respectively where the offences are committed against a person under 15 (fifteen) years of age, and the penalties prescribed by Sections 279 (1), 280 and 281 shall be doubled.\n2. Upon conviction for misdemeanour under this Section, the Court may order the forfeitures described in Section 30 of this Code\n"}, "SECTION 351": {"title": "ASSAULT ON ASCENDANT", "content": "The penalties prescribed by Section 275 on the one hand and by Sections 277 and 278 on the other hand shall become death and imprisonment for life respectively where the offences are committed against the legitimate, natural or adoptive father or mother of the offender, or against any other legitimate ascendant, and the penalties prescribed by Sections 279 (1), 280 and 281 shall be doubled.\n"}, "SECTION 352": {"title": "KIDNAPPING OF CHILD", "content": "1. Whoever without force or fraud takes or entices away any person under 18 (eighteen) years of age, against the will of those to whom custody belongs by law or by custom, or procures him to leave that custody shall be punished with imprisonment for from 1 (one) to 5 (five) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand): Provided that this Subsection shall not apply to a person misled as to the age of the minor. \n2. The subsequent marriage of the offender to the victim shall have no effect on the prosecution and conviction.\n"}, "SECTION 353": {"title": "KIDNAPPING BY FORCE OR FRAUD", "content": "Whoever by force or fraud takes or entices away any person under the age of twenty-one years, notwithstanding that he thought him older, and against the will of those to whom custody belongs by law or by custom or procures him to leave that custody shall be punished with imprisonment for from 5 (five) to 10 (ten) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 400 000 (four hundred thousand).\n"}, "SECTION 354": {"title": "AGGRAVATED KIDNAPPING", "content": "1. The punishment for kidnapping under either of the two last foregoing Sections shall be imprisonment for life where:\n- - the person kidnapped is under the age of thirteen; or\n- - the offender commits the offence with intent to obtain a ransom or obtains a ransom.\n1. The punishment shall be death where the minor dies as a result of the kidnapping\n"}, "SECTION 355": {"title": "F AILURE TO RETURN A CHILD", "content": "Whoever being in charge of a child fails to return him to those having\nthe right to claim him back shall be punished with imprisonment for from 1 (one) to 5 (five) years, and with fine of from CFAF 20 000 (twenty thousand) to CFAF 200 000 (two hundred thousand).\n"}, "SECTION 355-1": {"title": "INTERFERENCE WITH THE RIGHT TO VISIT", "content": "Any parent who interferes with the exercise by the other parent of the right granted by a court order to visit any child they have in common, shall be punished with imprisonment for from 6 (six) months to 1 (one) year or with fine of from CFAF 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand) or with both such imprisonment and fine.\n"}, "SECTION 355 -2": {"title": "INTERFERENCE WITH THE RIGHT TO EDUCATION OR TRAINING", "content": "1. Any parent with sufficient means who refuses to send his child to school, shall be punished with fine of from 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand).\n2. The punishment shall be imprisonment for from 1 (one) year to 2 (two) years where the offence is repeated.\n"}, "SECTION 356": {"title": "FORCED MARRIAGE", "content": "1. Whoever compels anyone to marry shall be punished with imprisonment for from five to 10 (ten) years. and with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 1 000 000 (one million).\n2. Where the victim is under the age of 18 (eighteen), the punishment may not be less than 2 (two) years imprisonment, whatever the mitigating circumstances.\n3. Whoever gives in marriage a boy or a girl under 18 (eighteen) shall be punished as under the two last foregoing Subsections.\n4. Upon conviction, the Court may deprive the offender of parental power and disqualify him from being the guardian or curator of any person for the time prescribed by Section 31 (4) of this Code.\n"}, "SECTION 357": {"title": "ABUSE IN RESPECT OF BRIDE-PRICE", "content": "1. Whoever:\n- a) receives from a third party the whole or any part of a bride-price for the promise in marriage of a woman already married or bound by a betrothal not yet broken off ; or\n- b) receives the whole or any part of a bride-price before refund to any earlier suitor; or\n- c) receives without any right to it the whole or any part of a bride-price for the marriage of a woman ; or\n- d) demands the whole or any part of an excessive bride-price for the marriage of a girl over 21 (twenty-one) years of age or of a widow or divorced woman; or\ne) for want of compliance with his excessive demands for bride-price for the marriage of a girl under the age of 21 (twenty-one), and for no other reason, obstructs her marriage; or\n- f) receives as heir any such consideration promised to the person from whom he inherits\nshall be punished with imprisonment for from 1 (one) to 5 (five) years or with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand) or with both such imprisonment and fine.\n1. Time shall begin to run again for prosecution on payment of the bride- price or of any instalment.\n"}, "SECTION 358": {"title": "DESERTION", "content": "1. Any spouse or parent who without just cause evades whether by desertion of the family home or otherwise howsoever, the whole or any part of his moral or material obligations towards his spouse or children shall be punished with imprisonment for from 3 (three) months to 1 (one) year or with fine of from CFAF 5 000 (five thousand) to CFAF 500 000 (five hundred thousand).\n2. Where a spouse alone has been deserted, no prosecution may be commenced without his or her complaint.\n3. The same punishment shall apply to a guardian or person responsible by custom who evades his obligations by law or custom towards any child in his custody.\n4. Upon conviction, the Court may order the forfeitures described in Section 30 of this Code disqualify the offender from being guardian or curator of any child for the time fixed by Section 31 (4). and for the same period\ndeprive him of parental power in respect of any one or more of his children.\n5. Where the person who received payment of the whole or a part of the bride-price is accessory to a wife's offence, he shall be punished with\nimprisonment for from 3 (three) months to 1 (one) year and with fine of from CFAF 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand).\n"}, "SECTION 358-1": {"title": "EVICTION FROM THE MATRIMONIAL HOME", "content": "1. The spouse who, outside any judicial proceedings and without a valid reason, evicts the other from the matrimonial home shall be punished with imprisonment for from 3 (three) months to 1 (one) year and with fine of from CFAF 50 000 (fifty thousand) to CFAF 500 000 (five hundred thousand).\n2. The penalty shall be imprisonment for from 2 (two) to 5 (five) years where:\n- a) the victim is a pregnant woman ;\n- b) the eviction is accompanied or preceded by physical or psychological violence, confiscation or destruction of the personal effects of the victim ; or\n- c) the eviction is caused by a person other than the spouse of the victim.\n"}, "SECTION 359": {"title": "BIGAMY", "content": "1. Whoever:\n- a) being polygamous contracts a monogamous marriage before the dissolution of ail previous marriages, or\n- b) being bound by an undertaking of monogamy contracts any marriage before dissolution of any previous marriage; or\n- c) being married under the codified law contracts any marriage before dissolution of that former marriage\nshall be punished with imprisonment for from 2 (two) months to 2 (two) years and with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 500 000 (five hundred thousand).\n1. The burden of proving dissolution of any previous marriage shall fait on the accused.\n"}, "SECTION 360": {"title": "INCEST", "content": "1. Without prejudice to the penalties prescribed by Sections 346 (3) and 347 (1 ), whoever has sexual intercourse with.\n- a) any legitimate or naturel ascendant or descendant in the direct line without limitation as to degree; or\n- b) his brother or sister, whether legitimate or natural, and whether of the whole or of the half-blood shall be punished with imprisonment for from 1 (one) to 3 (three) years and with fine of from CFAF 20 000 (twenty thousand) to CFAF 500 000 (five hundred thousand).\n1. Save in case of notorious concubinage or of incestuous marriage no prosecution may be commenced without the complaint of a relative by blood in whatever degree\n"}, "SECTION 361": {"title": "ADULTERY", "content": "1. A woman who, being married, has sexual intercourse with a man other than her husband shall be punished with imprisonment for from 2 (two) to 6 (six) months or with fine of from CFAF 25 000 (twenty-five thousand) to CFAF 100 000 (one hundred thousand).\n2. A husband who has sexual intercourse with a woman other than his wife or wives shall be punished as provided in Subsection 1 above.\nHowever, the burden of proof of the existence of a polygamous union shall lie with the husband.\n1. No prosecution may be commenced without the complaint of the wronged spouse.\n2. The connivance or condonation of the wronged spouse shall bar the commencement or continuation of any prosecution.\n3. Consent by the wronged spouse to résumé cohabitation shall put an end to the effects of conviction.\n"}}}}}, "PART IV": {"title": "SIMPLE OFFENCES", "chapters": {"CHAPTER I": {"title": "SIMPLE OFFENCES", "sections": {"SECTION 362 TO 370": {"title": "SIMPLE OFFENCES", "content": "The provisions of Section 362 to 370 which define\noffences shall be laid down by regulation.\n"}}}}}, "PART V": {"title": "TRANSITIONAL AND FINAL PROVISIONS", "chapters": {"CHAPTER I": {"title": "TRANSITIONAL AND FINAL PROVISIONS", "sections": {"SECTION 371": {"title": "", "content": "1. Ail previous provisions repugnant hereto and having the same objective are hereby repealed.\n2.  However, felonies, misdemeanours, or simple offence committed and previously prosecuted prior to the entry into force of this Law shall remain subject to the provisions of Law No. 65/LF/24 of 12 November1965 and NO 67/LF/1 of 12 June 1967, until the final judicial decision on related matters.\n"}, "SECTION 372": {"title": "", "content": "This law shall be registered, and published in the Official Gazette in English and French.\n"}}}}}}}